podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F15.h
/**
* @addtogroup ENC_Register_Masks_GROUP ENC Register Masks
* @brief Register Masks for ENC
* @{
*/
/* ------- CTRL Bit Fields                          ------ */
#define ENC_CTRL_CMPIE_MASK                      (0x01UL << ENC_CTRL_CMPIE_SHIFT)                    /*!< ENC_CTRL: CMPIE Mask                    */
#define ENC_CTRL_CMPIE_SHIFT                     0                                                   /*!< ENC_CTRL: CMPIE Position                */
#define ENC_CTRL_CMPIE(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_CMPIE_SHIFT))&ENC_CTRL_CMPIE_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_CMPIRQ_MASK                     (0x01UL << ENC_CTRL_CMPIRQ_SHIFT)                   /*!< ENC_CTRL: CMPIRQ Mask                   */
#define ENC_CTRL_CMPIRQ_SHIFT                    1                                                   /*!< ENC_CTRL: CMPIRQ Position               */
#define ENC_CTRL_CMPIRQ(x)                       (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_CMPIRQ_SHIFT))&ENC_CTRL_CMPIRQ_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_WDE_MASK                        (0x01UL << ENC_CTRL_WDE_SHIFT)                      /*!< ENC_CTRL: WDE Mask                      */
#define ENC_CTRL_WDE_SHIFT                       2                                                   /*!< ENC_CTRL: WDE Position                  */
#define ENC_CTRL_WDE(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_WDE_SHIFT))&ENC_CTRL_WDE_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_DIE_MASK                        (0x01UL << ENC_CTRL_DIE_SHIFT)                      /*!< ENC_CTRL: DIE Mask                      */
#define ENC_CTRL_DIE_SHIFT                       3                                                   /*!< ENC_CTRL: DIE Position                  */
#define ENC_CTRL_DIE(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_DIE_SHIFT))&ENC_CTRL_DIE_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_DIRQ_MASK                       (0x01UL << ENC_CTRL_DIRQ_SHIFT)                     /*!< ENC_CTRL: DIRQ Mask                     */
#define ENC_CTRL_DIRQ_SHIFT                      4                                                   /*!< ENC_CTRL: DIRQ Position                 */
#define ENC_CTRL_DIRQ(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_DIRQ_SHIFT))&ENC_CTRL_DIRQ_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_XNE_MASK                        (0x01UL << ENC_CTRL_XNE_SHIFT)                      /*!< ENC_CTRL: XNE Mask                      */
#define ENC_CTRL_XNE_SHIFT                       5                                                   /*!< ENC_CTRL: XNE Position                  */
#define ENC_CTRL_XNE(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_XNE_SHIFT))&ENC_CTRL_XNE_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_XIP_MASK                        (0x01UL << ENC_CTRL_XIP_SHIFT)                      /*!< ENC_CTRL: XIP Mask                      */
#define ENC_CTRL_XIP_SHIFT                       6                                                   /*!< ENC_CTRL: XIP Position                  */
#define ENC_CTRL_XIP(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_XIP_SHIFT))&ENC_CTRL_XIP_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_XIE_MASK                        (0x01UL << ENC_CTRL_XIE_SHIFT)                      /*!< ENC_CTRL: XIE Mask                      */
#define ENC_CTRL_XIE_SHIFT                       7                                                   /*!< ENC_CTRL: XIE Position                  */
#define ENC_CTRL_XIE(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_XIE_SHIFT))&ENC_CTRL_XIE_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_XIRQ_MASK                       (0x01UL << ENC_CTRL_XIRQ_SHIFT)                     /*!< ENC_CTRL: XIRQ Mask                     */
#define ENC_CTRL_XIRQ_SHIFT                      8                                                   /*!< ENC_CTRL: XIRQ Position                 */
#define ENC_CTRL_XIRQ(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_XIRQ_SHIFT))&ENC_CTRL_XIRQ_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_PH1_MASK                        (0x01UL << ENC_CTRL_PH1_SHIFT)                      /*!< ENC_CTRL: PH1 Mask                      */
#define ENC_CTRL_PH1_SHIFT                       9                                                   /*!< ENC_CTRL: PH1 Position                  */
#define ENC_CTRL_PH1(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_PH1_SHIFT))&ENC_CTRL_PH1_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_REV_MASK                        (0x01UL << ENC_CTRL_REV_SHIFT)                      /*!< ENC_CTRL: REV Mask                      */
#define ENC_CTRL_REV_SHIFT                       10                                                  /*!< ENC_CTRL: REV Position                  */
#define ENC_CTRL_REV(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_REV_SHIFT))&ENC_CTRL_REV_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_SWIP_MASK                       (0x01UL << ENC_CTRL_SWIP_SHIFT)                     /*!< ENC_CTRL: SWIP Mask                     */
#define ENC_CTRL_SWIP_SHIFT                      11                                                  /*!< ENC_CTRL: SWIP Position                 */
#define ENC_CTRL_SWIP(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_SWIP_SHIFT))&ENC_CTRL_SWIP_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_HNE_MASK                        (0x01UL << ENC_CTRL_HNE_SHIFT)                      /*!< ENC_CTRL: HNE Mask                      */
#define ENC_CTRL_HNE_SHIFT                       12                                                  /*!< ENC_CTRL: HNE Position                  */
#define ENC_CTRL_HNE(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_HNE_SHIFT))&ENC_CTRL_HNE_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_HIP_MASK                        (0x01UL << ENC_CTRL_HIP_SHIFT)                      /*!< ENC_CTRL: HIP Mask                      */
#define ENC_CTRL_HIP_SHIFT                       13                                                  /*!< ENC_CTRL: HIP Position                  */
#define ENC_CTRL_HIP(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_HIP_SHIFT))&ENC_CTRL_HIP_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_HIE_MASK                        (0x01UL << ENC_CTRL_HIE_SHIFT)                      /*!< ENC_CTRL: HIE Mask                      */
#define ENC_CTRL_HIE_SHIFT                       14                                                  /*!< ENC_CTRL: HIE Position                  */
#define ENC_CTRL_HIE(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_HIE_SHIFT))&ENC_CTRL_HIE_MASK) /*!< ENC_CTRL                                */
#define ENC_CTRL_HIRQ_MASK                       (0x01UL << ENC_CTRL_HIRQ_SHIFT)                     /*!< ENC_CTRL: HIRQ Mask                     */
#define ENC_CTRL_HIRQ_SHIFT                      15                                                  /*!< ENC_CTRL: HIRQ Position                 */
#define ENC_CTRL_HIRQ(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_CTRL_HIRQ_SHIFT))&ENC_CTRL_HIRQ_MASK) /*!< ENC_CTRL                                */
/* ------- FILT Bit Fields                          ------ */
#define ENC_FILT_FILT_PER_MASK                   (0xFFUL << ENC_FILT_FILT_PER_SHIFT)                 /*!< ENC_FILT: FILT_PER Mask                 */
#define ENC_FILT_FILT_PER_SHIFT                  0                                                   /*!< ENC_FILT: FILT_PER Position             */
#define ENC_FILT_FILT_PER(x)                     (((uint16_t)(((uint16_t)(x))<<ENC_FILT_FILT_PER_SHIFT))&ENC_FILT_FILT_PER_MASK) /*!< ENC_FILT                                */
#define ENC_FILT_FILT_CNT_MASK                   (0x07UL << ENC_FILT_FILT_CNT_SHIFT)                 /*!< ENC_FILT: FILT_CNT Mask                 */
#define ENC_FILT_FILT_CNT_SHIFT                  8                                                   /*!< ENC_FILT: FILT_CNT Position             */
#define ENC_FILT_FILT_CNT(x)                     (((uint16_t)(((uint16_t)(x))<<ENC_FILT_FILT_CNT_SHIFT))&ENC_FILT_FILT_CNT_MASK) /*!< ENC_FILT                                */
/* ------- WTR Bit Fields                           ------ */
#define ENC_WTR_WDOG_MASK                        (0xFFFFUL << ENC_WTR_WDOG_SHIFT)                    /*!< ENC_WTR: WDOG Mask                      */
#define ENC_WTR_WDOG_SHIFT                       0                                                   /*!< ENC_WTR: WDOG Position                  */
#define ENC_WTR_WDOG(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_WTR_WDOG_SHIFT))&ENC_WTR_WDOG_MASK) /*!< ENC_WTR                                 */
/* ------- POSD Bit Fields                          ------ */
#define ENC_POSD_POSD_MASK                       (0xFFFFUL << ENC_POSD_POSD_SHIFT)                   /*!< ENC_POSD: POSD Mask                     */
#define ENC_POSD_POSD_SHIFT                      0                                                   /*!< ENC_POSD: POSD Position                 */
#define ENC_POSD_POSD(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_POSD_POSD_SHIFT))&ENC_POSD_POSD_MASK) /*!< ENC_POSD                                */
/* ------- POSDH Bit Fields                         ------ */
#define ENC_POSDH_POSDH_MASK                     (0xFFFFUL << ENC_POSDH_POSDH_SHIFT)                 /*!< ENC_POSDH: POSDH Mask                   */
#define ENC_POSDH_POSDH_SHIFT                    0                                                   /*!< ENC_POSDH: POSDH Position               */
#define ENC_POSDH_POSDH(x)                       (((uint16_t)(((uint16_t)(x))<<ENC_POSDH_POSDH_SHIFT))&ENC_POSDH_POSDH_MASK) /*!< ENC_POSDH                               */
/* ------- REV Bit Fields                           ------ */
#define ENC_REV_REV_MASK                         (0xFFFFUL << ENC_REV_REV_SHIFT)                     /*!< ENC_REV: REV Mask                       */
#define ENC_REV_REV_SHIFT                        0                                                   /*!< ENC_REV: REV Position                   */
#define ENC_REV_REV(x)                           (((uint16_t)(((uint16_t)(x))<<ENC_REV_REV_SHIFT))&ENC_REV_REV_MASK) /*!< ENC_REV                                 */
/* ------- REVH Bit Fields                          ------ */
#define ENC_REVH_REVH_MASK                       (0xFFFFUL << ENC_REVH_REVH_SHIFT)                   /*!< ENC_REVH: REVH Mask                     */
#define ENC_REVH_REVH_SHIFT                      0                                                   /*!< ENC_REVH: REVH Position                 */
#define ENC_REVH_REVH(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_REVH_REVH_SHIFT))&ENC_REVH_REVH_MASK) /*!< ENC_REVH                                */
/* ------- UPOS Bit Fields                          ------ */
#define ENC_UPOS_POS_MASK                        (0xFFFFUL << ENC_UPOS_POS_SHIFT)                    /*!< ENC_UPOS: POS Mask                      */
#define ENC_UPOS_POS_SHIFT                       0                                                   /*!< ENC_UPOS: POS Position                  */
#define ENC_UPOS_POS(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_UPOS_POS_SHIFT))&ENC_UPOS_POS_MASK) /*!< ENC_UPOS                                */
/* ------- LPOS Bit Fields                          ------ */
#define ENC_LPOS_POS_MASK                        (0xFFFFUL << ENC_LPOS_POS_SHIFT)                    /*!< ENC_LPOS: POS Mask                      */
#define ENC_LPOS_POS_SHIFT                       0                                                   /*!< ENC_LPOS: POS Position                  */
#define ENC_LPOS_POS(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_LPOS_POS_SHIFT))&ENC_LPOS_POS_MASK) /*!< ENC_LPOS                                */
/* ------- UPOSH Bit Fields                         ------ */
#define ENC_UPOSH_POSH_MASK                      (0xFFFFUL << ENC_UPOSH_POSH_SHIFT)                  /*!< ENC_UPOSH: POSH Mask                    */
#define ENC_UPOSH_POSH_SHIFT                     0                                                   /*!< ENC_UPOSH: POSH Position                */
#define ENC_UPOSH_POSH(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_UPOSH_POSH_SHIFT))&ENC_UPOSH_POSH_MASK) /*!< ENC_UPOSH                               */
/* ------- LPOSH Bit Fields                         ------ */
#define ENC_LPOSH_POSH_MASK                      (0xFFFFUL << ENC_LPOSH_POSH_SHIFT)                  /*!< ENC_LPOSH: POSH Mask                    */
#define ENC_LPOSH_POSH_SHIFT                     0                                                   /*!< ENC_LPOSH: POSH Position                */
#define ENC_LPOSH_POSH(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_LPOSH_POSH_SHIFT))&ENC_LPOSH_POSH_MASK) /*!< ENC_LPOSH                               */
/* ------- UINIT Bit Fields                         ------ */
#define ENC_UINIT_INIT_MASK                      (0xFFFFUL << ENC_UINIT_INIT_SHIFT)                  /*!< ENC_UINIT: INIT Mask                    */
#define ENC_UINIT_INIT_SHIFT                     0                                                   /*!< ENC_UINIT: INIT Position                */
#define ENC_UINIT_INIT(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_UINIT_INIT_SHIFT))&ENC_UINIT_INIT_MASK) /*!< ENC_UINIT                               */
/* ------- LINIT Bit Fields                         ------ */
#define ENC_LINIT_INIT_MASK                      (0xFFFFUL << ENC_LINIT_INIT_SHIFT)                  /*!< ENC_LINIT: INIT Mask                    */
#define ENC_LINIT_INIT_SHIFT                     0                                                   /*!< ENC_LINIT: INIT Position                */
#define ENC_LINIT_INIT(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_LINIT_INIT_SHIFT))&ENC_LINIT_INIT_MASK) /*!< ENC_LINIT                               */
/* ------- IMR Bit Fields                           ------ */
#define ENC_IMR_HOME_MASK                        (0x01UL << ENC_IMR_HOME_SHIFT)                      /*!< ENC_IMR: HOME Mask                      */
#define ENC_IMR_HOME_SHIFT                       0                                                   /*!< ENC_IMR: HOME Position                  */
#define ENC_IMR_HOME(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_IMR_HOME_SHIFT))&ENC_IMR_HOME_MASK) /*!< ENC_IMR                                 */
#define ENC_IMR_INDEX_MASK                       (0x01UL << ENC_IMR_INDEX_SHIFT)                     /*!< ENC_IMR: INDEX Mask                     */
#define ENC_IMR_INDEX_SHIFT                      1                                                   /*!< ENC_IMR: INDEX Position                 */
#define ENC_IMR_INDEX(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_IMR_INDEX_SHIFT))&ENC_IMR_INDEX_MASK) /*!< ENC_IMR                                 */
#define ENC_IMR_PHB_MASK                         (0x01UL << ENC_IMR_PHB_SHIFT)                       /*!< ENC_IMR: PHB Mask                       */
#define ENC_IMR_PHB_SHIFT                        2                                                   /*!< ENC_IMR: PHB Position                   */
#define ENC_IMR_PHB(x)                           (((uint16_t)(((uint16_t)(x))<<ENC_IMR_PHB_SHIFT))&ENC_IMR_PHB_MASK) /*!< ENC_IMR                                 */
#define ENC_IMR_PHA_MASK                         (0x01UL << ENC_IMR_PHA_SHIFT)                       /*!< ENC_IMR: PHA Mask                       */
#define ENC_IMR_PHA_SHIFT                        3                                                   /*!< ENC_IMR: PHA Position                   */
#define ENC_IMR_PHA(x)                           (((uint16_t)(((uint16_t)(x))<<ENC_IMR_PHA_SHIFT))&ENC_IMR_PHA_MASK) /*!< ENC_IMR                                 */
#define ENC_IMR_FHOM_MASK                        (0x01UL << ENC_IMR_FHOM_SHIFT)                      /*!< ENC_IMR: FHOM Mask                      */
#define ENC_IMR_FHOM_SHIFT                       4                                                   /*!< ENC_IMR: FHOM Position                  */
#define ENC_IMR_FHOM(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_IMR_FHOM_SHIFT))&ENC_IMR_FHOM_MASK) /*!< ENC_IMR                                 */
#define ENC_IMR_FIND_MASK                        (0x01UL << ENC_IMR_FIND_SHIFT)                      /*!< ENC_IMR: FIND Mask                      */
#define ENC_IMR_FIND_SHIFT                       5                                                   /*!< ENC_IMR: FIND Position                  */
#define ENC_IMR_FIND(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_IMR_FIND_SHIFT))&ENC_IMR_FIND_MASK) /*!< ENC_IMR                                 */
#define ENC_IMR_FPHB_MASK                        (0x01UL << ENC_IMR_FPHB_SHIFT)                      /*!< ENC_IMR: FPHB Mask                      */
#define ENC_IMR_FPHB_SHIFT                       6                                                   /*!< ENC_IMR: FPHB Position                  */
#define ENC_IMR_FPHB(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_IMR_FPHB_SHIFT))&ENC_IMR_FPHB_MASK) /*!< ENC_IMR                                 */
#define ENC_IMR_FPHA_MASK                        (0x01UL << ENC_IMR_FPHA_SHIFT)                      /*!< ENC_IMR: FPHA Mask                      */
#define ENC_IMR_FPHA_SHIFT                       7                                                   /*!< ENC_IMR: FPHA Position                  */
#define ENC_IMR_FPHA(x)                          (((uint16_t)(((uint16_t)(x))<<ENC_IMR_FPHA_SHIFT))&ENC_IMR_FPHA_MASK) /*!< ENC_IMR                                 */
/* ------- TST Bit Fields                           ------ */
#define ENC_TST_TEST_COUNT_MASK                  (0xFFUL << ENC_TST_TEST_COUNT_SHIFT)                /*!< ENC_TST: TEST_COUNT Mask                */
#define ENC_TST_TEST_COUNT_SHIFT                 0                                                   /*!< ENC_TST: TEST_COUNT Position            */
#define ENC_TST_TEST_COUNT(x)                    (((uint16_t)(((uint16_t)(x))<<ENC_TST_TEST_COUNT_SHIFT))&ENC_TST_TEST_COUNT_MASK) /*!< ENC_TST                                 */
#define ENC_TST_TEST_PERIOD_MASK                 (0x1FUL << ENC_TST_TEST_PERIOD_SHIFT)               /*!< ENC_TST: TEST_PERIOD Mask               */
#define ENC_TST_TEST_PERIOD_SHIFT                8                                                   /*!< ENC_TST: TEST_PERIOD Position           */
#define ENC_TST_TEST_PERIOD(x)                   (((uint16_t)(((uint16_t)(x))<<ENC_TST_TEST_PERIOD_SHIFT))&ENC_TST_TEST_PERIOD_MASK) /*!< ENC_TST                                 */
#define ENC_TST_QDN_MASK                         (0x01UL << ENC_TST_QDN_SHIFT)                       /*!< ENC_TST: QDN Mask                       */
#define ENC_TST_QDN_SHIFT                        13                                                  /*!< ENC_TST: QDN Position                   */
#define ENC_TST_QDN(x)                           (((uint16_t)(((uint16_t)(x))<<ENC_TST_QDN_SHIFT))&ENC_TST_QDN_MASK) /*!< ENC_TST                                 */
#define ENC_TST_TCE_MASK                         (0x01UL << ENC_TST_TCE_SHIFT)                       /*!< ENC_TST: TCE Mask                       */
#define ENC_TST_TCE_SHIFT                        14                                                  /*!< ENC_TST: TCE Position                   */
#define ENC_TST_TCE(x)                           (((uint16_t)(((uint16_t)(x))<<ENC_TST_TCE_SHIFT))&ENC_TST_TCE_MASK) /*!< ENC_TST                                 */
#define ENC_TST_TEN_MASK                         (0x01UL << ENC_TST_TEN_SHIFT)                       /*!< ENC_TST: TEN Mask                       */
#define ENC_TST_TEN_SHIFT                        15                                                  /*!< ENC_TST: TEN Position                   */
#define ENC_TST_TEN(x)                           (((uint16_t)(((uint16_t)(x))<<ENC_TST_TEN_SHIFT))&ENC_TST_TEN_MASK) /*!< ENC_TST                                 */
/* ------- CTRL2 Bit Fields                         ------ */
#define ENC_CTRL2_UPDHLD_MASK                    (0x01UL << ENC_CTRL2_UPDHLD_SHIFT)                  /*!< ENC_CTRL2: UPDHLD Mask                  */
#define ENC_CTRL2_UPDHLD_SHIFT                   0                                                   /*!< ENC_CTRL2: UPDHLD Position              */
#define ENC_CTRL2_UPDHLD(x)                      (((uint16_t)(((uint16_t)(x))<<ENC_CTRL2_UPDHLD_SHIFT))&ENC_CTRL2_UPDHLD_MASK) /*!< ENC_CTRL2                               */
#define ENC_CTRL2_UPDPOS_MASK                    (0x01UL << ENC_CTRL2_UPDPOS_SHIFT)                  /*!< ENC_CTRL2: UPDPOS Mask                  */
#define ENC_CTRL2_UPDPOS_SHIFT                   1                                                   /*!< ENC_CTRL2: UPDPOS Position              */
#define ENC_CTRL2_UPDPOS(x)                      (((uint16_t)(((uint16_t)(x))<<ENC_CTRL2_UPDPOS_SHIFT))&ENC_CTRL2_UPDPOS_MASK) /*!< ENC_CTRL2                               */
#define ENC_CTRL2_MOD_MASK                       (0x01UL << ENC_CTRL2_MOD_SHIFT)                     /*!< ENC_CTRL2: MOD Mask                     */
#define ENC_CTRL2_MOD_SHIFT                      2                                                   /*!< ENC_CTRL2: MOD Position                 */
#define ENC_CTRL2_MOD(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_CTRL2_MOD_SHIFT))&ENC_CTRL2_MOD_MASK) /*!< ENC_CTRL2                               */
#define ENC_CTRL2_DIR_MASK                       (0x01UL << ENC_CTRL2_DIR_SHIFT)                     /*!< ENC_CTRL2: DIR Mask                     */
#define ENC_CTRL2_DIR_SHIFT                      3                                                   /*!< ENC_CTRL2: DIR Position                 */
#define ENC_CTRL2_DIR(x)                         (((uint16_t)(((uint16_t)(x))<<ENC_CTRL2_DIR_SHIFT))&ENC_CTRL2_DIR_MASK) /*!< ENC_CTRL2                               */
#define ENC_CTRL2_RUIE_MASK                      (0x01UL << ENC_CTRL2_RUIE_SHIFT)                    /*!< ENC_CTRL2: RUIE Mask                    */
#define ENC_CTRL2_RUIE_SHIFT                     4                                                   /*!< ENC_CTRL2: RUIE Position                */
#define ENC_CTRL2_RUIE(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_CTRL2_RUIE_SHIFT))&ENC_CTRL2_RUIE_MASK) /*!< ENC_CTRL2                               */
#define ENC_CTRL2_RUIRQ_MASK                     (0x01UL << ENC_CTRL2_RUIRQ_SHIFT)                   /*!< ENC_CTRL2: RUIRQ Mask                   */
#define ENC_CTRL2_RUIRQ_SHIFT                    5                                                   /*!< ENC_CTRL2: RUIRQ Position               */
#define ENC_CTRL2_RUIRQ(x)                       (((uint16_t)(((uint16_t)(x))<<ENC_CTRL2_RUIRQ_SHIFT))&ENC_CTRL2_RUIRQ_MASK) /*!< ENC_CTRL2                               */
#define ENC_CTRL2_ROIE_MASK                      (0x01UL << ENC_CTRL2_ROIE_SHIFT)                    /*!< ENC_CTRL2: ROIE Mask                    */
#define ENC_CTRL2_ROIE_SHIFT                     6                                                   /*!< ENC_CTRL2: ROIE Position                */
#define ENC_CTRL2_ROIE(x)                        (((uint16_t)(((uint16_t)(x))<<ENC_CTRL2_ROIE_SHIFT))&ENC_CTRL2_ROIE_MASK) /*!< ENC_CTRL2                               */
