podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F15.h
#define PWMA_SM1CTRL_DBLX(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_DBLX_SHIFT))&PWMA_SM1CTRL_DBLX_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_LDMOD_MASK                  (0x01UL << PWMA_SM1CTRL_LDMOD_SHIFT)                /*!< PWMA_SM1CTRL: LDMOD Mask                */
#define PWMA_SM1CTRL_LDMOD_SHIFT                 2                                                   /*!< PWMA_SM1CTRL: LDMOD Position            */
#define PWMA_SM1CTRL_LDMOD(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_LDMOD_SHIFT))&PWMA_SM1CTRL_LDMOD_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_PRSC_MASK                   (0x07UL << PWMA_SM1CTRL_PRSC_SHIFT)                 /*!< PWMA_SM1CTRL: PRSC Mask                 */
#define PWMA_SM1CTRL_PRSC_SHIFT                  4                                                   /*!< PWMA_SM1CTRL: PRSC Position             */
#define PWMA_SM1CTRL_PRSC(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_PRSC_SHIFT))&PWMA_SM1CTRL_PRSC_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_DT_MASK                     (0x03UL << PWMA_SM1CTRL_DT_SHIFT)                   /*!< PWMA_SM1CTRL: DT Mask                   */
#define PWMA_SM1CTRL_DT_SHIFT                    8                                                   /*!< PWMA_SM1CTRL: DT Position               */
#define PWMA_SM1CTRL_DT(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_DT_SHIFT))&PWMA_SM1CTRL_DT_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_FULL_MASK                   (0x01UL << PWMA_SM1CTRL_FULL_SHIFT)                 /*!< PWMA_SM1CTRL: FULL Mask                 */
#define PWMA_SM1CTRL_FULL_SHIFT                  10                                                  /*!< PWMA_SM1CTRL: FULL Position             */
#define PWMA_SM1CTRL_FULL(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_FULL_SHIFT))&PWMA_SM1CTRL_FULL_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_HALF_MASK                   (0x01UL << PWMA_SM1CTRL_HALF_SHIFT)                 /*!< PWMA_SM1CTRL: HALF Mask                 */
#define PWMA_SM1CTRL_HALF_SHIFT                  11                                                  /*!< PWMA_SM1CTRL: HALF Position             */
#define PWMA_SM1CTRL_HALF(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_HALF_SHIFT))&PWMA_SM1CTRL_HALF_MASK) /*!< PWMA_SM1CTRL                            */
#define PWMA_SM1CTRL_LDFQ_MASK                   (0x0FUL << PWMA_SM1CTRL_LDFQ_SHIFT)                 /*!< PWMA_SM1CTRL: LDFQ Mask                 */
#define PWMA_SM1CTRL_LDFQ_SHIFT                  12                                                  /*!< PWMA_SM1CTRL: LDFQ Position             */
#define PWMA_SM1CTRL_LDFQ(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1CTRL_LDFQ_SHIFT))&PWMA_SM1CTRL_LDFQ_MASK) /*!< PWMA_SM1CTRL                            */
/* ------- SM1VAL0 Bit Fields                       ------ */
#define PWMA_SM1VAL0_VAL0_MASK                   (0xFFFFUL << PWMA_SM1VAL0_VAL0_SHIFT)               /*!< PWMA_SM1VAL0: VAL0 Mask                 */
#define PWMA_SM1VAL0_VAL0_SHIFT                  0                                                   /*!< PWMA_SM1VAL0: VAL0 Position             */
#define PWMA_SM1VAL0_VAL0(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL0_VAL0_SHIFT))&PWMA_SM1VAL0_VAL0_MASK) /*!< PWMA_SM1VAL0                            */
/* ------- SM1FRACVAL1 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL1_FRACVAL1_MASK           (0x1FUL << PWMA_SM1FRACVAL1_FRACVAL1_SHIFT)         /*!< PWMA_SM1FRACVAL1: FRACVAL1 Mask         */
#define PWMA_SM1FRACVAL1_FRACVAL1_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL1: FRACVAL1 Position     */
#define PWMA_SM1FRACVAL1_FRACVAL1(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL1_FRACVAL1_SHIFT))&PWMA_SM1FRACVAL1_FRACVAL1_MASK) /*!< PWMA_SM1FRACVAL1                        */
/* ------- SM1VAL1 Bit Fields                       ------ */
#define PWMA_SM1VAL1_VAL1_MASK                   (0xFFFFUL << PWMA_SM1VAL1_VAL1_SHIFT)               /*!< PWMA_SM1VAL1: VAL1 Mask                 */
#define PWMA_SM1VAL1_VAL1_SHIFT                  0                                                   /*!< PWMA_SM1VAL1: VAL1 Position             */
#define PWMA_SM1VAL1_VAL1(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL1_VAL1_SHIFT))&PWMA_SM1VAL1_VAL1_MASK) /*!< PWMA_SM1VAL1                            */
/* ------- SM1FRACVAL2 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL2_FRACVAL2_MASK           (0x1FUL << PWMA_SM1FRACVAL2_FRACVAL2_SHIFT)         /*!< PWMA_SM1FRACVAL2: FRACVAL2 Mask         */
#define PWMA_SM1FRACVAL2_FRACVAL2_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL2: FRACVAL2 Position     */
#define PWMA_SM1FRACVAL2_FRACVAL2(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL2_FRACVAL2_SHIFT))&PWMA_SM1FRACVAL2_FRACVAL2_MASK) /*!< PWMA_SM1FRACVAL2                        */
/* ------- SM1VAL2 Bit Fields                       ------ */
#define PWMA_SM1VAL2_VAL2_MASK                   (0xFFFFUL << PWMA_SM1VAL2_VAL2_SHIFT)               /*!< PWMA_SM1VAL2: VAL2 Mask                 */
#define PWMA_SM1VAL2_VAL2_SHIFT                  0                                                   /*!< PWMA_SM1VAL2: VAL2 Position             */
#define PWMA_SM1VAL2_VAL2(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL2_VAL2_SHIFT))&PWMA_SM1VAL2_VAL2_MASK) /*!< PWMA_SM1VAL2                            */
/* ------- SM1FRACVAL3 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL3_FRACVAL3_MASK           (0x1FUL << PWMA_SM1FRACVAL3_FRACVAL3_SHIFT)         /*!< PWMA_SM1FRACVAL3: FRACVAL3 Mask         */
#define PWMA_SM1FRACVAL3_FRACVAL3_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL3: FRACVAL3 Position     */
#define PWMA_SM1FRACVAL3_FRACVAL3(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL3_FRACVAL3_SHIFT))&PWMA_SM1FRACVAL3_FRACVAL3_MASK) /*!< PWMA_SM1FRACVAL3                        */
/* ------- SM1VAL3 Bit Fields                       ------ */
#define PWMA_SM1VAL3_VAL3_MASK                   (0xFFFFUL << PWMA_SM1VAL3_VAL3_SHIFT)               /*!< PWMA_SM1VAL3: VAL3 Mask                 */
#define PWMA_SM1VAL3_VAL3_SHIFT                  0                                                   /*!< PWMA_SM1VAL3: VAL3 Position             */
#define PWMA_SM1VAL3_VAL3(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL3_VAL3_SHIFT))&PWMA_SM1VAL3_VAL3_MASK) /*!< PWMA_SM1VAL3                            */
/* ------- SM1FRACVAL4 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL4_FRACVAL4_MASK           (0x1FUL << PWMA_SM1FRACVAL4_FRACVAL4_SHIFT)         /*!< PWMA_SM1FRACVAL4: FRACVAL4 Mask         */
#define PWMA_SM1FRACVAL4_FRACVAL4_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL4: FRACVAL4 Position     */
#define PWMA_SM1FRACVAL4_FRACVAL4(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL4_FRACVAL4_SHIFT))&PWMA_SM1FRACVAL4_FRACVAL4_MASK) /*!< PWMA_SM1FRACVAL4                        */
/* ------- SM1VAL4 Bit Fields                       ------ */
#define PWMA_SM1VAL4_VAL4_MASK                   (0xFFFFUL << PWMA_SM1VAL4_VAL4_SHIFT)               /*!< PWMA_SM1VAL4: VAL4 Mask                 */
#define PWMA_SM1VAL4_VAL4_SHIFT                  0                                                   /*!< PWMA_SM1VAL4: VAL4 Position             */
#define PWMA_SM1VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL4_VAL4_SHIFT))&PWMA_SM1VAL4_VAL4_MASK) /*!< PWMA_SM1VAL4                            */
/* ------- SM1FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM1FRACVAL5_FRACVAL5_MASK           (0x1FUL << PWMA_SM1FRACVAL5_FRACVAL5_SHIFT)         /*!< PWMA_SM1FRACVAL5: FRACVAL5 Mask         */
#define PWMA_SM1FRACVAL5_FRACVAL5_SHIFT          11                                                  /*!< PWMA_SM1FRACVAL5: FRACVAL5 Position     */
#define PWMA_SM1FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRACVAL5_FRACVAL5_SHIFT))&PWMA_SM1FRACVAL5_FRACVAL5_MASK) /*!< PWMA_SM1FRACVAL5                        */
/* ------- SM1VAL5 Bit Fields                       ------ */
#define PWMA_SM1VAL5_VAL5_MASK                   (0xFFFFUL << PWMA_SM1VAL5_VAL5_SHIFT)               /*!< PWMA_SM1VAL5: VAL5 Mask                 */
#define PWMA_SM1VAL5_VAL5_SHIFT                  0                                                   /*!< PWMA_SM1VAL5: VAL5 Position             */
#define PWMA_SM1VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM1VAL5_VAL5_SHIFT))&PWMA_SM1VAL5_VAL5_MASK) /*!< PWMA_SM1VAL5                            */
/* ------- SM1FRCTRL Bit Fields                     ------ */
#define PWMA_SM1FRCTRL_FRAC1_EN_MASK             (0x01UL << PWMA_SM1FRCTRL_FRAC1_EN_SHIFT)           /*!< PWMA_SM1FRCTRL: FRAC1_EN Mask           */
#define PWMA_SM1FRCTRL_FRAC1_EN_SHIFT            1                                                   /*!< PWMA_SM1FRCTRL: FRAC1_EN Position       */
#define PWMA_SM1FRCTRL_FRAC1_EN(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRCTRL_FRAC1_EN_SHIFT))&PWMA_SM1FRCTRL_FRAC1_EN_MASK) /*!< PWMA_SM1FRCTRL                          */
#define PWMA_SM1FRCTRL_FRAC23_EN_MASK            (0x01UL << PWMA_SM1FRCTRL_FRAC23_EN_SHIFT)          /*!< PWMA_SM1FRCTRL: FRAC23_EN Mask          */
#define PWMA_SM1FRCTRL_FRAC23_EN_SHIFT           2                                                   /*!< PWMA_SM1FRCTRL: FRAC23_EN Position      */
#define PWMA_SM1FRCTRL_FRAC23_EN(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRCTRL_FRAC23_EN_SHIFT))&PWMA_SM1FRCTRL_FRAC23_EN_MASK) /*!< PWMA_SM1FRCTRL                          */
#define PWMA_SM1FRCTRL_FRAC45_EN_MASK            (0x01UL << PWMA_SM1FRCTRL_FRAC45_EN_SHIFT)          /*!< PWMA_SM1FRCTRL: FRAC45_EN Mask          */
#define PWMA_SM1FRCTRL_FRAC45_EN_SHIFT           4                                                   /*!< PWMA_SM1FRCTRL: FRAC45_EN Position      */
#define PWMA_SM1FRCTRL_FRAC45_EN(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRCTRL_FRAC45_EN_SHIFT))&PWMA_SM1FRCTRL_FRAC45_EN_MASK) /*!< PWMA_SM1FRCTRL                          */
#define PWMA_SM1FRCTRL_FRAC_PU_MASK              (0x01UL << PWMA_SM1FRCTRL_FRAC_PU_SHIFT)            /*!< PWMA_SM1FRCTRL: FRAC_PU Mask            */
#define PWMA_SM1FRCTRL_FRAC_PU_SHIFT             8                                                   /*!< PWMA_SM1FRCTRL: FRAC_PU Position        */
#define PWMA_SM1FRCTRL_FRAC_PU(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRCTRL_FRAC_PU_SHIFT))&PWMA_SM1FRCTRL_FRAC_PU_MASK) /*!< PWMA_SM1FRCTRL                          */
#define PWMA_SM1FRCTRL_TEST_MASK                 (0x01UL << PWMA_SM1FRCTRL_TEST_SHIFT)               /*!< PWMA_SM1FRCTRL: TEST Mask               */
#define PWMA_SM1FRCTRL_TEST_SHIFT                15                                                  /*!< PWMA_SM1FRCTRL: TEST Position           */
#define PWMA_SM1FRCTRL_TEST(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1FRCTRL_TEST_SHIFT))&PWMA_SM1FRCTRL_TEST_MASK) /*!< PWMA_SM1FRCTRL                          */
/* ------- SM1OCTRL Bit Fields                      ------ */
#define PWMA_SM1OCTRL_PWMXFS_MASK                (0x03UL << PWMA_SM1OCTRL_PWMXFS_SHIFT)              /*!< PWMA_SM1OCTRL: PWMXFS Mask              */
#define PWMA_SM1OCTRL_PWMXFS_SHIFT               0                                                   /*!< PWMA_SM1OCTRL: PWMXFS Position          */
#define PWMA_SM1OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMXFS_SHIFT))&PWMA_SM1OCTRL_PWMXFS_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_PWMBFS_MASK                (0x03UL << PWMA_SM1OCTRL_PWMBFS_SHIFT)              /*!< PWMA_SM1OCTRL: PWMBFS Mask              */
#define PWMA_SM1OCTRL_PWMBFS_SHIFT               2                                                   /*!< PWMA_SM1OCTRL: PWMBFS Position          */
#define PWMA_SM1OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMBFS_SHIFT))&PWMA_SM1OCTRL_PWMBFS_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_PWMAFS_MASK                (0x03UL << PWMA_SM1OCTRL_PWMAFS_SHIFT)              /*!< PWMA_SM1OCTRL: PWMAFS Mask              */
#define PWMA_SM1OCTRL_PWMAFS_SHIFT               4                                                   /*!< PWMA_SM1OCTRL: PWMAFS Position          */
#define PWMA_SM1OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMAFS_SHIFT))&PWMA_SM1OCTRL_PWMAFS_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_POLX_MASK                  (0x01UL << PWMA_SM1OCTRL_POLX_SHIFT)                /*!< PWMA_SM1OCTRL: POLX Mask                */
#define PWMA_SM1OCTRL_POLX_SHIFT                 8                                                   /*!< PWMA_SM1OCTRL: POLX Position            */
#define PWMA_SM1OCTRL_POLX(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_POLX_SHIFT))&PWMA_SM1OCTRL_POLX_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_POLB_MASK                  (0x01UL << PWMA_SM1OCTRL_POLB_SHIFT)                /*!< PWMA_SM1OCTRL: POLB Mask                */
#define PWMA_SM1OCTRL_POLB_SHIFT                 9                                                   /*!< PWMA_SM1OCTRL: POLB Position            */
#define PWMA_SM1OCTRL_POLB(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_POLB_SHIFT))&PWMA_SM1OCTRL_POLB_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_POLA_MASK                  (0x01UL << PWMA_SM1OCTRL_POLA_SHIFT)                /*!< PWMA_SM1OCTRL: POLA Mask                */
#define PWMA_SM1OCTRL_POLA_SHIFT                 10                                                  /*!< PWMA_SM1OCTRL: POLA Position            */
#define PWMA_SM1OCTRL_POLA(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_POLA_SHIFT))&PWMA_SM1OCTRL_POLA_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_PWMX_IN_MASK               (0x01UL << PWMA_SM1OCTRL_PWMX_IN_SHIFT)             /*!< PWMA_SM1OCTRL: PWMX_IN Mask             */
#define PWMA_SM1OCTRL_PWMX_IN_SHIFT              13                                                  /*!< PWMA_SM1OCTRL: PWMX_IN Position         */
#define PWMA_SM1OCTRL_PWMX_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMX_IN_SHIFT))&PWMA_SM1OCTRL_PWMX_IN_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_PWMB_IN_MASK               (0x01UL << PWMA_SM1OCTRL_PWMB_IN_SHIFT)             /*!< PWMA_SM1OCTRL: PWMB_IN Mask             */
#define PWMA_SM1OCTRL_PWMB_IN_SHIFT              14                                                  /*!< PWMA_SM1OCTRL: PWMB_IN Position         */
#define PWMA_SM1OCTRL_PWMB_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMB_IN_SHIFT))&PWMA_SM1OCTRL_PWMB_IN_MASK) /*!< PWMA_SM1OCTRL                           */
#define PWMA_SM1OCTRL_PWMA_IN_MASK               (0x01UL << PWMA_SM1OCTRL_PWMA_IN_SHIFT)             /*!< PWMA_SM1OCTRL: PWMA_IN Mask             */
#define PWMA_SM1OCTRL_PWMA_IN_SHIFT              15                                                  /*!< PWMA_SM1OCTRL: PWMA_IN Position         */
#define PWMA_SM1OCTRL_PWMA_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM1OCTRL_PWMA_IN_SHIFT))&PWMA_SM1OCTRL_PWMA_IN_MASK) /*!< PWMA_SM1OCTRL                           */
/* ------- SM1STS Bit Fields                        ------ */
#define PWMA_SM1STS_CMPF_MASK                    (0x3FUL << PWMA_SM1STS_CMPF_SHIFT)                  /*!< PWMA_SM1STS: CMPF Mask                  */
#define PWMA_SM1STS_CMPF_SHIFT                   0                                                   /*!< PWMA_SM1STS: CMPF Position              */
#define PWMA_SM1STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_CMPF_SHIFT))&PWMA_SM1STS_CMPF_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_CFX0_MASK                    (0x01UL << PWMA_SM1STS_CFX0_SHIFT)                  /*!< PWMA_SM1STS: CFX0 Mask                  */
#define PWMA_SM1STS_CFX0_SHIFT                   6                                                   /*!< PWMA_SM1STS: CFX0 Position              */
#define PWMA_SM1STS_CFX0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_CFX0_SHIFT))&PWMA_SM1STS_CFX0_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_CFX1_MASK                    (0x01UL << PWMA_SM1STS_CFX1_SHIFT)                  /*!< PWMA_SM1STS: CFX1 Mask                  */
#define PWMA_SM1STS_CFX1_SHIFT                   7                                                   /*!< PWMA_SM1STS: CFX1 Position              */
#define PWMA_SM1STS_CFX1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_CFX1_SHIFT))&PWMA_SM1STS_CFX1_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_CFB0_MASK                    (0x01UL << PWMA_SM1STS_CFB0_SHIFT)                  /*!< PWMA_SM1STS: CFB0 Mask                  */
#define PWMA_SM1STS_CFB0_SHIFT                   8                                                   /*!< PWMA_SM1STS: CFB0 Position              */
#define PWMA_SM1STS_CFB0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_CFB0_SHIFT))&PWMA_SM1STS_CFB0_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_CFB1_MASK                    (0x01UL << PWMA_SM1STS_CFB1_SHIFT)                  /*!< PWMA_SM1STS: CFB1 Mask                  */
#define PWMA_SM1STS_CFB1_SHIFT                   9                                                   /*!< PWMA_SM1STS: CFB1 Position              */
#define PWMA_SM1STS_CFB1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_CFB1_SHIFT))&PWMA_SM1STS_CFB1_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_CFA0_MASK                    (0x01UL << PWMA_SM1STS_CFA0_SHIFT)                  /*!< PWMA_SM1STS: CFA0 Mask                  */
#define PWMA_SM1STS_CFA0_SHIFT                   10                                                  /*!< PWMA_SM1STS: CFA0 Position              */
#define PWMA_SM1STS_CFA0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_CFA0_SHIFT))&PWMA_SM1STS_CFA0_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_CFA1_MASK                    (0x01UL << PWMA_SM1STS_CFA1_SHIFT)                  /*!< PWMA_SM1STS: CFA1 Mask                  */
#define PWMA_SM1STS_CFA1_SHIFT                   11                                                  /*!< PWMA_SM1STS: CFA1 Position              */
#define PWMA_SM1STS_CFA1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_CFA1_SHIFT))&PWMA_SM1STS_CFA1_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_RF_MASK                      (0x01UL << PWMA_SM1STS_RF_SHIFT)                    /*!< PWMA_SM1STS: RF Mask                    */
#define PWMA_SM1STS_RF_SHIFT                     12                                                  /*!< PWMA_SM1STS: RF Position                */
#define PWMA_SM1STS_RF(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_RF_SHIFT))&PWMA_SM1STS_RF_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_REF_MASK                     (0x01UL << PWMA_SM1STS_REF_SHIFT)                   /*!< PWMA_SM1STS: REF Mask                   */
#define PWMA_SM1STS_REF_SHIFT                    13                                                  /*!< PWMA_SM1STS: REF Position               */
#define PWMA_SM1STS_REF(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_REF_SHIFT))&PWMA_SM1STS_REF_MASK) /*!< PWMA_SM1STS                             */
#define PWMA_SM1STS_RUF_MASK                     (0x01UL << PWMA_SM1STS_RUF_SHIFT)                   /*!< PWMA_SM1STS: RUF Mask                   */
#define PWMA_SM1STS_RUF_SHIFT                    14                                                  /*!< PWMA_SM1STS: RUF Position               */
#define PWMA_SM1STS_RUF(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM1STS_RUF_SHIFT))&PWMA_SM1STS_RUF_MASK) /*!< PWMA_SM1STS                             */
/* ------- SM1INTEN Bit Fields                      ------ */
#define PWMA_SM1INTEN_CMPIE_MASK                 (0x3FUL << PWMA_SM1INTEN_CMPIE_SHIFT)               /*!< PWMA_SM1INTEN: CMPIE Mask               */
#define PWMA_SM1INTEN_CMPIE_SHIFT                0                                                   /*!< PWMA_SM1INTEN: CMPIE Position           */
#define PWMA_SM1INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_CMPIE_SHIFT))&PWMA_SM1INTEN_CMPIE_MASK) /*!< PWMA_SM1INTEN                           */
#define PWMA_SM1INTEN_CX0IE_MASK                 (0x01UL << PWMA_SM1INTEN_CX0IE_SHIFT)               /*!< PWMA_SM1INTEN: CX0IE Mask               */
#define PWMA_SM1INTEN_CX0IE_SHIFT                6                                                   /*!< PWMA_SM1INTEN: CX0IE Position           */
#define PWMA_SM1INTEN_CX0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_CX0IE_SHIFT))&PWMA_SM1INTEN_CX0IE_MASK) /*!< PWMA_SM1INTEN                           */
#define PWMA_SM1INTEN_CX1IE_MASK                 (0x01UL << PWMA_SM1INTEN_CX1IE_SHIFT)               /*!< PWMA_SM1INTEN: CX1IE Mask               */
#define PWMA_SM1INTEN_CX1IE_SHIFT                7                                                   /*!< PWMA_SM1INTEN: CX1IE Position           */
#define PWMA_SM1INTEN_CX1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_CX1IE_SHIFT))&PWMA_SM1INTEN_CX1IE_MASK) /*!< PWMA_SM1INTEN                           */
#define PWMA_SM1INTEN_CB0IE_MASK                 (0x01UL << PWMA_SM1INTEN_CB0IE_SHIFT)               /*!< PWMA_SM1INTEN: CB0IE Mask               */
#define PWMA_SM1INTEN_CB0IE_SHIFT                8                                                   /*!< PWMA_SM1INTEN: CB0IE Position           */
#define PWMA_SM1INTEN_CB0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_CB0IE_SHIFT))&PWMA_SM1INTEN_CB0IE_MASK) /*!< PWMA_SM1INTEN                           */
#define PWMA_SM1INTEN_CB1IE_MASK                 (0x01UL << PWMA_SM1INTEN_CB1IE_SHIFT)               /*!< PWMA_SM1INTEN: CB1IE Mask               */
#define PWMA_SM1INTEN_CB1IE_SHIFT                9                                                   /*!< PWMA_SM1INTEN: CB1IE Position           */
#define PWMA_SM1INTEN_CB1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_CB1IE_SHIFT))&PWMA_SM1INTEN_CB1IE_MASK) /*!< PWMA_SM1INTEN                           */
#define PWMA_SM1INTEN_CA0IE_MASK                 (0x01UL << PWMA_SM1INTEN_CA0IE_SHIFT)               /*!< PWMA_SM1INTEN: CA0IE Mask               */
#define PWMA_SM1INTEN_CA0IE_SHIFT                10                                                  /*!< PWMA_SM1INTEN: CA0IE Position           */
#define PWMA_SM1INTEN_CA0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM1INTEN_CA0IE_SHIFT))&PWMA_SM1INTEN_CA0IE_MASK) /*!< PWMA_SM1INTEN                           */
#define PWMA_SM1INTEN_CA1IE_MASK                 (0x01UL << PWMA_SM1INTEN_CA1IE_SHIFT)               /*!< PWMA_SM1INTEN: CA1IE Mask               */
#define PWMA_SM1INTEN_CA1IE_SHIFT                11                                                  /*!< PWMA_SM1INTEN: CA1IE Position           */
