podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F15.h
#define PWMA_SM2VAL4_VAL4(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2VAL4_VAL4_SHIFT))&PWMA_SM2VAL4_VAL4_MASK) /*!< PWMA_SM2VAL4                            */
/* ------- SM2FRACVAL5 Bit Fields                   ------ */
#define PWMA_SM2FRACVAL5_FRACVAL5_MASK           (0x1FUL << PWMA_SM2FRACVAL5_FRACVAL5_SHIFT)         /*!< PWMA_SM2FRACVAL5: FRACVAL5 Mask         */
#define PWMA_SM2FRACVAL5_FRACVAL5_SHIFT          11                                                  /*!< PWMA_SM2FRACVAL5: FRACVAL5 Position     */
#define PWMA_SM2FRACVAL5_FRACVAL5(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRACVAL5_FRACVAL5_SHIFT))&PWMA_SM2FRACVAL5_FRACVAL5_MASK) /*!< PWMA_SM2FRACVAL5                        */
/* ------- SM2VAL5 Bit Fields                       ------ */
#define PWMA_SM2VAL5_VAL5_MASK                   (0xFFFFUL << PWMA_SM2VAL5_VAL5_SHIFT)               /*!< PWMA_SM2VAL5: VAL5 Mask                 */
#define PWMA_SM2VAL5_VAL5_SHIFT                  0                                                   /*!< PWMA_SM2VAL5: VAL5 Position             */
#define PWMA_SM2VAL5_VAL5(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2VAL5_VAL5_SHIFT))&PWMA_SM2VAL5_VAL5_MASK) /*!< PWMA_SM2VAL5                            */
/* ------- SM2FRCTRL Bit Fields                     ------ */
#define PWMA_SM2FRCTRL_FRAC1_EN_MASK             (0x01UL << PWMA_SM2FRCTRL_FRAC1_EN_SHIFT)           /*!< PWMA_SM2FRCTRL: FRAC1_EN Mask           */
#define PWMA_SM2FRCTRL_FRAC1_EN_SHIFT            1                                                   /*!< PWMA_SM2FRCTRL: FRAC1_EN Position       */
#define PWMA_SM2FRCTRL_FRAC1_EN(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRCTRL_FRAC1_EN_SHIFT))&PWMA_SM2FRCTRL_FRAC1_EN_MASK) /*!< PWMA_SM2FRCTRL                          */
#define PWMA_SM2FRCTRL_FRAC23_EN_MASK            (0x01UL << PWMA_SM2FRCTRL_FRAC23_EN_SHIFT)          /*!< PWMA_SM2FRCTRL: FRAC23_EN Mask          */
#define PWMA_SM2FRCTRL_FRAC23_EN_SHIFT           2                                                   /*!< PWMA_SM2FRCTRL: FRAC23_EN Position      */
#define PWMA_SM2FRCTRL_FRAC23_EN(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRCTRL_FRAC23_EN_SHIFT))&PWMA_SM2FRCTRL_FRAC23_EN_MASK) /*!< PWMA_SM2FRCTRL                          */
#define PWMA_SM2FRCTRL_FRAC45_EN_MASK            (0x01UL << PWMA_SM2FRCTRL_FRAC45_EN_SHIFT)          /*!< PWMA_SM2FRCTRL: FRAC45_EN Mask          */
#define PWMA_SM2FRCTRL_FRAC45_EN_SHIFT           4                                                   /*!< PWMA_SM2FRCTRL: FRAC45_EN Position      */
#define PWMA_SM2FRCTRL_FRAC45_EN(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRCTRL_FRAC45_EN_SHIFT))&PWMA_SM2FRCTRL_FRAC45_EN_MASK) /*!< PWMA_SM2FRCTRL                          */
#define PWMA_SM2FRCTRL_FRAC_PU_MASK              (0x01UL << PWMA_SM2FRCTRL_FRAC_PU_SHIFT)            /*!< PWMA_SM2FRCTRL: FRAC_PU Mask            */
#define PWMA_SM2FRCTRL_FRAC_PU_SHIFT             8                                                   /*!< PWMA_SM2FRCTRL: FRAC_PU Position        */
#define PWMA_SM2FRCTRL_FRAC_PU(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRCTRL_FRAC_PU_SHIFT))&PWMA_SM2FRCTRL_FRAC_PU_MASK) /*!< PWMA_SM2FRCTRL                          */
#define PWMA_SM2FRCTRL_TEST_MASK                 (0x01UL << PWMA_SM2FRCTRL_TEST_SHIFT)               /*!< PWMA_SM2FRCTRL: TEST Mask               */
#define PWMA_SM2FRCTRL_TEST_SHIFT                15                                                  /*!< PWMA_SM2FRCTRL: TEST Position           */
#define PWMA_SM2FRCTRL_TEST(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2FRCTRL_TEST_SHIFT))&PWMA_SM2FRCTRL_TEST_MASK) /*!< PWMA_SM2FRCTRL                          */
/* ------- SM2OCTRL Bit Fields                      ------ */
#define PWMA_SM2OCTRL_PWMXFS_MASK                (0x03UL << PWMA_SM2OCTRL_PWMXFS_SHIFT)              /*!< PWMA_SM2OCTRL: PWMXFS Mask              */
#define PWMA_SM2OCTRL_PWMXFS_SHIFT               0                                                   /*!< PWMA_SM2OCTRL: PWMXFS Position          */
#define PWMA_SM2OCTRL_PWMXFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMXFS_SHIFT))&PWMA_SM2OCTRL_PWMXFS_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_PWMBFS_MASK                (0x03UL << PWMA_SM2OCTRL_PWMBFS_SHIFT)              /*!< PWMA_SM2OCTRL: PWMBFS Mask              */
#define PWMA_SM2OCTRL_PWMBFS_SHIFT               2                                                   /*!< PWMA_SM2OCTRL: PWMBFS Position          */
#define PWMA_SM2OCTRL_PWMBFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMBFS_SHIFT))&PWMA_SM2OCTRL_PWMBFS_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_PWMAFS_MASK                (0x03UL << PWMA_SM2OCTRL_PWMAFS_SHIFT)              /*!< PWMA_SM2OCTRL: PWMAFS Mask              */
#define PWMA_SM2OCTRL_PWMAFS_SHIFT               4                                                   /*!< PWMA_SM2OCTRL: PWMAFS Position          */
#define PWMA_SM2OCTRL_PWMAFS(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMAFS_SHIFT))&PWMA_SM2OCTRL_PWMAFS_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_POLX_MASK                  (0x01UL << PWMA_SM2OCTRL_POLX_SHIFT)                /*!< PWMA_SM2OCTRL: POLX Mask                */
#define PWMA_SM2OCTRL_POLX_SHIFT                 8                                                   /*!< PWMA_SM2OCTRL: POLX Position            */
#define PWMA_SM2OCTRL_POLX(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_POLX_SHIFT))&PWMA_SM2OCTRL_POLX_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_POLB_MASK                  (0x01UL << PWMA_SM2OCTRL_POLB_SHIFT)                /*!< PWMA_SM2OCTRL: POLB Mask                */
#define PWMA_SM2OCTRL_POLB_SHIFT                 9                                                   /*!< PWMA_SM2OCTRL: POLB Position            */
#define PWMA_SM2OCTRL_POLB(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_POLB_SHIFT))&PWMA_SM2OCTRL_POLB_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_POLA_MASK                  (0x01UL << PWMA_SM2OCTRL_POLA_SHIFT)                /*!< PWMA_SM2OCTRL: POLA Mask                */
#define PWMA_SM2OCTRL_POLA_SHIFT                 10                                                  /*!< PWMA_SM2OCTRL: POLA Position            */
#define PWMA_SM2OCTRL_POLA(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_POLA_SHIFT))&PWMA_SM2OCTRL_POLA_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_PWMX_IN_MASK               (0x01UL << PWMA_SM2OCTRL_PWMX_IN_SHIFT)             /*!< PWMA_SM2OCTRL: PWMX_IN Mask             */
#define PWMA_SM2OCTRL_PWMX_IN_SHIFT              13                                                  /*!< PWMA_SM2OCTRL: PWMX_IN Position         */
#define PWMA_SM2OCTRL_PWMX_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMX_IN_SHIFT))&PWMA_SM2OCTRL_PWMX_IN_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_PWMB_IN_MASK               (0x01UL << PWMA_SM2OCTRL_PWMB_IN_SHIFT)             /*!< PWMA_SM2OCTRL: PWMB_IN Mask             */
#define PWMA_SM2OCTRL_PWMB_IN_SHIFT              14                                                  /*!< PWMA_SM2OCTRL: PWMB_IN Position         */
#define PWMA_SM2OCTRL_PWMB_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMB_IN_SHIFT))&PWMA_SM2OCTRL_PWMB_IN_MASK) /*!< PWMA_SM2OCTRL                           */
#define PWMA_SM2OCTRL_PWMA_IN_MASK               (0x01UL << PWMA_SM2OCTRL_PWMA_IN_SHIFT)             /*!< PWMA_SM2OCTRL: PWMA_IN Mask             */
#define PWMA_SM2OCTRL_PWMA_IN_SHIFT              15                                                  /*!< PWMA_SM2OCTRL: PWMA_IN Position         */
#define PWMA_SM2OCTRL_PWMA_IN(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2OCTRL_PWMA_IN_SHIFT))&PWMA_SM2OCTRL_PWMA_IN_MASK) /*!< PWMA_SM2OCTRL                           */
/* ------- SM2STS Bit Fields                        ------ */
#define PWMA_SM2STS_CMPF_MASK                    (0x3FUL << PWMA_SM2STS_CMPF_SHIFT)                  /*!< PWMA_SM2STS: CMPF Mask                  */
#define PWMA_SM2STS_CMPF_SHIFT                   0                                                   /*!< PWMA_SM2STS: CMPF Position              */
#define PWMA_SM2STS_CMPF(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_CMPF_SHIFT))&PWMA_SM2STS_CMPF_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_CFX0_MASK                    (0x01UL << PWMA_SM2STS_CFX0_SHIFT)                  /*!< PWMA_SM2STS: CFX0 Mask                  */
#define PWMA_SM2STS_CFX0_SHIFT                   6                                                   /*!< PWMA_SM2STS: CFX0 Position              */
#define PWMA_SM2STS_CFX0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_CFX0_SHIFT))&PWMA_SM2STS_CFX0_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_CFX1_MASK                    (0x01UL << PWMA_SM2STS_CFX1_SHIFT)                  /*!< PWMA_SM2STS: CFX1 Mask                  */
#define PWMA_SM2STS_CFX1_SHIFT                   7                                                   /*!< PWMA_SM2STS: CFX1 Position              */
#define PWMA_SM2STS_CFX1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_CFX1_SHIFT))&PWMA_SM2STS_CFX1_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_CFB0_MASK                    (0x01UL << PWMA_SM2STS_CFB0_SHIFT)                  /*!< PWMA_SM2STS: CFB0 Mask                  */
#define PWMA_SM2STS_CFB0_SHIFT                   8                                                   /*!< PWMA_SM2STS: CFB0 Position              */
#define PWMA_SM2STS_CFB0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_CFB0_SHIFT))&PWMA_SM2STS_CFB0_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_CFB1_MASK                    (0x01UL << PWMA_SM2STS_CFB1_SHIFT)                  /*!< PWMA_SM2STS: CFB1 Mask                  */
#define PWMA_SM2STS_CFB1_SHIFT                   9                                                   /*!< PWMA_SM2STS: CFB1 Position              */
#define PWMA_SM2STS_CFB1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_CFB1_SHIFT))&PWMA_SM2STS_CFB1_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_CFA0_MASK                    (0x01UL << PWMA_SM2STS_CFA0_SHIFT)                  /*!< PWMA_SM2STS: CFA0 Mask                  */
#define PWMA_SM2STS_CFA0_SHIFT                   10                                                  /*!< PWMA_SM2STS: CFA0 Position              */
#define PWMA_SM2STS_CFA0(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_CFA0_SHIFT))&PWMA_SM2STS_CFA0_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_CFA1_MASK                    (0x01UL << PWMA_SM2STS_CFA1_SHIFT)                  /*!< PWMA_SM2STS: CFA1 Mask                  */
#define PWMA_SM2STS_CFA1_SHIFT                   11                                                  /*!< PWMA_SM2STS: CFA1 Position              */
#define PWMA_SM2STS_CFA1(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_CFA1_SHIFT))&PWMA_SM2STS_CFA1_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_RF_MASK                      (0x01UL << PWMA_SM2STS_RF_SHIFT)                    /*!< PWMA_SM2STS: RF Mask                    */
#define PWMA_SM2STS_RF_SHIFT                     12                                                  /*!< PWMA_SM2STS: RF Position                */
#define PWMA_SM2STS_RF(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_RF_SHIFT))&PWMA_SM2STS_RF_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_REF_MASK                     (0x01UL << PWMA_SM2STS_REF_SHIFT)                   /*!< PWMA_SM2STS: REF Mask                   */
#define PWMA_SM2STS_REF_SHIFT                    13                                                  /*!< PWMA_SM2STS: REF Position               */
#define PWMA_SM2STS_REF(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_REF_SHIFT))&PWMA_SM2STS_REF_MASK) /*!< PWMA_SM2STS                             */
#define PWMA_SM2STS_RUF_MASK                     (0x01UL << PWMA_SM2STS_RUF_SHIFT)                   /*!< PWMA_SM2STS: RUF Mask                   */
#define PWMA_SM2STS_RUF_SHIFT                    14                                                  /*!< PWMA_SM2STS: RUF Position               */
#define PWMA_SM2STS_RUF(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_SM2STS_RUF_SHIFT))&PWMA_SM2STS_RUF_MASK) /*!< PWMA_SM2STS                             */
/* ------- SM2INTEN Bit Fields                      ------ */
#define PWMA_SM2INTEN_CMPIE_MASK                 (0x3FUL << PWMA_SM2INTEN_CMPIE_SHIFT)               /*!< PWMA_SM2INTEN: CMPIE Mask               */
#define PWMA_SM2INTEN_CMPIE_SHIFT                0                                                   /*!< PWMA_SM2INTEN: CMPIE Position           */
#define PWMA_SM2INTEN_CMPIE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_CMPIE_SHIFT))&PWMA_SM2INTEN_CMPIE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_CX0IE_MASK                 (0x01UL << PWMA_SM2INTEN_CX0IE_SHIFT)               /*!< PWMA_SM2INTEN: CX0IE Mask               */
#define PWMA_SM2INTEN_CX0IE_SHIFT                6                                                   /*!< PWMA_SM2INTEN: CX0IE Position           */
#define PWMA_SM2INTEN_CX0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_CX0IE_SHIFT))&PWMA_SM2INTEN_CX0IE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_CX1IE_MASK                 (0x01UL << PWMA_SM2INTEN_CX1IE_SHIFT)               /*!< PWMA_SM2INTEN: CX1IE Mask               */
#define PWMA_SM2INTEN_CX1IE_SHIFT                7                                                   /*!< PWMA_SM2INTEN: CX1IE Position           */
#define PWMA_SM2INTEN_CX1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_CX1IE_SHIFT))&PWMA_SM2INTEN_CX1IE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_CB0IE_MASK                 (0x01UL << PWMA_SM2INTEN_CB0IE_SHIFT)               /*!< PWMA_SM2INTEN: CB0IE Mask               */
#define PWMA_SM2INTEN_CB0IE_SHIFT                8                                                   /*!< PWMA_SM2INTEN: CB0IE Position           */
#define PWMA_SM2INTEN_CB0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_CB0IE_SHIFT))&PWMA_SM2INTEN_CB0IE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_CB1IE_MASK                 (0x01UL << PWMA_SM2INTEN_CB1IE_SHIFT)               /*!< PWMA_SM2INTEN: CB1IE Mask               */
#define PWMA_SM2INTEN_CB1IE_SHIFT                9                                                   /*!< PWMA_SM2INTEN: CB1IE Position           */
#define PWMA_SM2INTEN_CB1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_CB1IE_SHIFT))&PWMA_SM2INTEN_CB1IE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_CA0IE_MASK                 (0x01UL << PWMA_SM2INTEN_CA0IE_SHIFT)               /*!< PWMA_SM2INTEN: CA0IE Mask               */
#define PWMA_SM2INTEN_CA0IE_SHIFT                10                                                  /*!< PWMA_SM2INTEN: CA0IE Position           */
#define PWMA_SM2INTEN_CA0IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_CA0IE_SHIFT))&PWMA_SM2INTEN_CA0IE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_CA1IE_MASK                 (0x01UL << PWMA_SM2INTEN_CA1IE_SHIFT)               /*!< PWMA_SM2INTEN: CA1IE Mask               */
#define PWMA_SM2INTEN_CA1IE_SHIFT                11                                                  /*!< PWMA_SM2INTEN: CA1IE Position           */
#define PWMA_SM2INTEN_CA1IE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_CA1IE_SHIFT))&PWMA_SM2INTEN_CA1IE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_RIE_MASK                   (0x01UL << PWMA_SM2INTEN_RIE_SHIFT)                 /*!< PWMA_SM2INTEN: RIE Mask                 */
#define PWMA_SM2INTEN_RIE_SHIFT                  12                                                  /*!< PWMA_SM2INTEN: RIE Position             */
#define PWMA_SM2INTEN_RIE(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_RIE_SHIFT))&PWMA_SM2INTEN_RIE_MASK) /*!< PWMA_SM2INTEN                           */
#define PWMA_SM2INTEN_REIE_MASK                  (0x01UL << PWMA_SM2INTEN_REIE_SHIFT)                /*!< PWMA_SM2INTEN: REIE Mask                */
#define PWMA_SM2INTEN_REIE_SHIFT                 13                                                  /*!< PWMA_SM2INTEN: REIE Position            */
#define PWMA_SM2INTEN_REIE(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM2INTEN_REIE_SHIFT))&PWMA_SM2INTEN_REIE_MASK) /*!< PWMA_SM2INTEN                           */
/* ------- SM2DMAEN Bit Fields                      ------ */
#define PWMA_SM2DMAEN_CX0DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CX0DE_SHIFT)               /*!< PWMA_SM2DMAEN: CX0DE Mask               */
#define PWMA_SM2DMAEN_CX0DE_SHIFT                0                                                   /*!< PWMA_SM2DMAEN: CX0DE Position           */
#define PWMA_SM2DMAEN_CX0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_CX0DE_SHIFT))&PWMA_SM2DMAEN_CX0DE_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_CX1DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CX1DE_SHIFT)               /*!< PWMA_SM2DMAEN: CX1DE Mask               */
#define PWMA_SM2DMAEN_CX1DE_SHIFT                1                                                   /*!< PWMA_SM2DMAEN: CX1DE Position           */
#define PWMA_SM2DMAEN_CX1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_CX1DE_SHIFT))&PWMA_SM2DMAEN_CX1DE_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_CB0DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CB0DE_SHIFT)               /*!< PWMA_SM2DMAEN: CB0DE Mask               */
#define PWMA_SM2DMAEN_CB0DE_SHIFT                2                                                   /*!< PWMA_SM2DMAEN: CB0DE Position           */
#define PWMA_SM2DMAEN_CB0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_CB0DE_SHIFT))&PWMA_SM2DMAEN_CB0DE_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_CB1DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CB1DE_SHIFT)               /*!< PWMA_SM2DMAEN: CB1DE Mask               */
#define PWMA_SM2DMAEN_CB1DE_SHIFT                3                                                   /*!< PWMA_SM2DMAEN: CB1DE Position           */
#define PWMA_SM2DMAEN_CB1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_CB1DE_SHIFT))&PWMA_SM2DMAEN_CB1DE_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_CA0DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CA0DE_SHIFT)               /*!< PWMA_SM2DMAEN: CA0DE Mask               */
#define PWMA_SM2DMAEN_CA0DE_SHIFT                4                                                   /*!< PWMA_SM2DMAEN: CA0DE Position           */
#define PWMA_SM2DMAEN_CA0DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_CA0DE_SHIFT))&PWMA_SM2DMAEN_CA0DE_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_CA1DE_MASK                 (0x01UL << PWMA_SM2DMAEN_CA1DE_SHIFT)               /*!< PWMA_SM2DMAEN: CA1DE Mask               */
#define PWMA_SM2DMAEN_CA1DE_SHIFT                5                                                   /*!< PWMA_SM2DMAEN: CA1DE Position           */
#define PWMA_SM2DMAEN_CA1DE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_CA1DE_SHIFT))&PWMA_SM2DMAEN_CA1DE_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_CAPTDE_MASK                (0x03UL << PWMA_SM2DMAEN_CAPTDE_SHIFT)              /*!< PWMA_SM2DMAEN: CAPTDE Mask              */
#define PWMA_SM2DMAEN_CAPTDE_SHIFT               6                                                   /*!< PWMA_SM2DMAEN: CAPTDE Position          */
#define PWMA_SM2DMAEN_CAPTDE(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_CAPTDE_SHIFT))&PWMA_SM2DMAEN_CAPTDE_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_FAND_MASK                  (0x01UL << PWMA_SM2DMAEN_FAND_SHIFT)                /*!< PWMA_SM2DMAEN: FAND Mask                */
#define PWMA_SM2DMAEN_FAND_SHIFT                 8                                                   /*!< PWMA_SM2DMAEN: FAND Position            */
#define PWMA_SM2DMAEN_FAND(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_FAND_SHIFT))&PWMA_SM2DMAEN_FAND_MASK) /*!< PWMA_SM2DMAEN                           */
#define PWMA_SM2DMAEN_VALDE_MASK                 (0x01UL << PWMA_SM2DMAEN_VALDE_SHIFT)               /*!< PWMA_SM2DMAEN: VALDE Mask               */
#define PWMA_SM2DMAEN_VALDE_SHIFT                9                                                   /*!< PWMA_SM2DMAEN: VALDE Position           */
#define PWMA_SM2DMAEN_VALDE(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DMAEN_VALDE_SHIFT))&PWMA_SM2DMAEN_VALDE_MASK) /*!< PWMA_SM2DMAEN                           */
/* ------- SM2TCTRL Bit Fields                      ------ */
#define PWMA_SM2TCTRL_OUT_TRIG_EN_MASK           (0x3FUL << PWMA_SM2TCTRL_OUT_TRIG_EN_SHIFT)         /*!< PWMA_SM2TCTRL: OUT_TRIG_EN Mask         */
#define PWMA_SM2TCTRL_OUT_TRIG_EN_SHIFT          0                                                   /*!< PWMA_SM2TCTRL: OUT_TRIG_EN Position     */
#define PWMA_SM2TCTRL_OUT_TRIG_EN(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2TCTRL_OUT_TRIG_EN_SHIFT))&PWMA_SM2TCTRL_OUT_TRIG_EN_MASK) /*!< PWMA_SM2TCTRL                           */
#define PWMA_SM2TCTRL_PWBOT1_MASK                (0x01UL << PWMA_SM2TCTRL_PWBOT1_SHIFT)              /*!< PWMA_SM2TCTRL: PWBOT1 Mask              */
#define PWMA_SM2TCTRL_PWBOT1_SHIFT               14                                                  /*!< PWMA_SM2TCTRL: PWBOT1 Position          */
#define PWMA_SM2TCTRL_PWBOT1(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2TCTRL_PWBOT1_SHIFT))&PWMA_SM2TCTRL_PWBOT1_MASK) /*!< PWMA_SM2TCTRL                           */
#define PWMA_SM2TCTRL_PWAOT0_MASK                (0x01UL << PWMA_SM2TCTRL_PWAOT0_SHIFT)              /*!< PWMA_SM2TCTRL: PWAOT0 Mask              */
#define PWMA_SM2TCTRL_PWAOT0_SHIFT               15                                                  /*!< PWMA_SM2TCTRL: PWAOT0 Position          */
#define PWMA_SM2TCTRL_PWAOT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2TCTRL_PWAOT0_SHIFT))&PWMA_SM2TCTRL_PWAOT0_MASK) /*!< PWMA_SM2TCTRL                           */
/* ------- SM2DISMAP0 Bit Fields                    ------ */
#define PWMA_SM2DISMAP0_DIS0A_MASK               (0x0FUL << PWMA_SM2DISMAP0_DIS0A_SHIFT)             /*!< PWMA_SM2DISMAP0: DIS0A Mask             */
#define PWMA_SM2DISMAP0_DIS0A_SHIFT              0                                                   /*!< PWMA_SM2DISMAP0: DIS0A Position         */
#define PWMA_SM2DISMAP0_DIS0A(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DISMAP0_DIS0A_SHIFT))&PWMA_SM2DISMAP0_DIS0A_MASK) /*!< PWMA_SM2DISMAP0                         */
#define PWMA_SM2DISMAP0_DIS0B_MASK               (0x0FUL << PWMA_SM2DISMAP0_DIS0B_SHIFT)             /*!< PWMA_SM2DISMAP0: DIS0B Mask             */
