podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F15.h
#define PWMA_SM2DISMAP0_DIS0B_SHIFT              4                                                   /*!< PWMA_SM2DISMAP0: DIS0B Position         */
#define PWMA_SM2DISMAP0_DIS0B(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DISMAP0_DIS0B_SHIFT))&PWMA_SM2DISMAP0_DIS0B_MASK) /*!< PWMA_SM2DISMAP0                         */
#define PWMA_SM2DISMAP0_DIS0X_MASK               (0x0FUL << PWMA_SM2DISMAP0_DIS0X_SHIFT)             /*!< PWMA_SM2DISMAP0: DIS0X Mask             */
#define PWMA_SM2DISMAP0_DIS0X_SHIFT              8                                                   /*!< PWMA_SM2DISMAP0: DIS0X Position         */
#define PWMA_SM2DISMAP0_DIS0X(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DISMAP0_DIS0X_SHIFT))&PWMA_SM2DISMAP0_DIS0X_MASK) /*!< PWMA_SM2DISMAP0                         */
/* ------- SM2DTCNT Bit Fields                      ------ */
#define PWMA_SM2DTCNT_DTCNT0_MASK                (0x7FFUL << PWMA_SM2DTCNT_DTCNT0_SHIFT)             /*!< PWMA_SM2DTCNT: DTCNT0 Mask              */
#define PWMA_SM2DTCNT_DTCNT0_SHIFT               0                                                   /*!< PWMA_SM2DTCNT: DTCNT0 Position          */
#define PWMA_SM2DTCNT_DTCNT0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SM2DTCNT_DTCNT0_SHIFT))&PWMA_SM2DTCNT_DTCNT0_MASK) /*!< PWMA_SM2DTCNT                           */
/* ------- SM2CAPTCTRLA Bit Fields                  ------ */
#define PWMA_SM2CAPTCTRLA_ARMA_MASK              (0x01UL << PWMA_SM2CAPTCTRLA_ARMA_SHIFT)            /*!< PWMA_SM2CAPTCTRLA: ARMA Mask            */
#define PWMA_SM2CAPTCTRLA_ARMA_SHIFT             0                                                   /*!< PWMA_SM2CAPTCTRLA: ARMA Position        */
#define PWMA_SM2CAPTCTRLA_ARMA(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_ARMA_SHIFT))&PWMA_SM2CAPTCTRLA_ARMA_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_ONESHOTA_MASK          (0x01UL << PWMA_SM2CAPTCTRLA_ONESHOTA_SHIFT)        /*!< PWMA_SM2CAPTCTRLA: ONESHOTA Mask        */
#define PWMA_SM2CAPTCTRLA_ONESHOTA_SHIFT         1                                                   /*!< PWMA_SM2CAPTCTRLA: ONESHOTA Position    */
#define PWMA_SM2CAPTCTRLA_ONESHOTA(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_ONESHOTA_SHIFT))&PWMA_SM2CAPTCTRLA_ONESHOTA_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_EDGA0_MASK             (0x03UL << PWMA_SM2CAPTCTRLA_EDGA0_SHIFT)           /*!< PWMA_SM2CAPTCTRLA: EDGA0 Mask           */
#define PWMA_SM2CAPTCTRLA_EDGA0_SHIFT            2                                                   /*!< PWMA_SM2CAPTCTRLA: EDGA0 Position       */
#define PWMA_SM2CAPTCTRLA_EDGA0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_EDGA0_SHIFT))&PWMA_SM2CAPTCTRLA_EDGA0_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_EDGA1_MASK             (0x03UL << PWMA_SM2CAPTCTRLA_EDGA1_SHIFT)           /*!< PWMA_SM2CAPTCTRLA: EDGA1 Mask           */
#define PWMA_SM2CAPTCTRLA_EDGA1_SHIFT            4                                                   /*!< PWMA_SM2CAPTCTRLA: EDGA1 Position       */
#define PWMA_SM2CAPTCTRLA_EDGA1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_EDGA1_SHIFT))&PWMA_SM2CAPTCTRLA_EDGA1_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_INP_SELA_MASK          (0x01UL << PWMA_SM2CAPTCTRLA_INP_SELA_SHIFT)        /*!< PWMA_SM2CAPTCTRLA: INP_SELA Mask        */
#define PWMA_SM2CAPTCTRLA_INP_SELA_SHIFT         6                                                   /*!< PWMA_SM2CAPTCTRLA: INP_SELA Position    */
#define PWMA_SM2CAPTCTRLA_INP_SELA(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_INP_SELA_SHIFT))&PWMA_SM2CAPTCTRLA_INP_SELA_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_EDGCNTA_EN_MASK        (0x01UL << PWMA_SM2CAPTCTRLA_EDGCNTA_EN_SHIFT)      /*!< PWMA_SM2CAPTCTRLA: EDGCNTA_EN Mask      */
#define PWMA_SM2CAPTCTRLA_EDGCNTA_EN_SHIFT       7                                                   /*!< PWMA_SM2CAPTCTRLA: EDGCNTA_EN Position  */
#define PWMA_SM2CAPTCTRLA_EDGCNTA_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_EDGCNTA_EN_SHIFT))&PWMA_SM2CAPTCTRLA_EDGCNTA_EN_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_CFAWM_MASK             (0x03UL << PWMA_SM2CAPTCTRLA_CFAWM_SHIFT)           /*!< PWMA_SM2CAPTCTRLA: CFAWM Mask           */
#define PWMA_SM2CAPTCTRLA_CFAWM_SHIFT            8                                                   /*!< PWMA_SM2CAPTCTRLA: CFAWM Position       */
#define PWMA_SM2CAPTCTRLA_CFAWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_CFAWM_SHIFT))&PWMA_SM2CAPTCTRLA_CFAWM_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_CA0CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLA_CA0CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLA: CA0CNT Mask          */
#define PWMA_SM2CAPTCTRLA_CA0CNT_SHIFT           10                                                  /*!< PWMA_SM2CAPTCTRLA: CA0CNT Position      */
#define PWMA_SM2CAPTCTRLA_CA0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_CA0CNT_SHIFT))&PWMA_SM2CAPTCTRLA_CA0CNT_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
#define PWMA_SM2CAPTCTRLA_CA1CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLA_CA1CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLA: CA1CNT Mask          */
#define PWMA_SM2CAPTCTRLA_CA1CNT_SHIFT           13                                                  /*!< PWMA_SM2CAPTCTRLA: CA1CNT Position      */
#define PWMA_SM2CAPTCTRLA_CA1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLA_CA1CNT_SHIFT))&PWMA_SM2CAPTCTRLA_CA1CNT_MASK) /*!< PWMA_SM2CAPTCTRLA                       */
/* ------- SM2CAPTCOMPA Bit Fields                  ------ */
#define PWMA_SM2CAPTCOMPA_EDGCMPA_MASK           (0xFFUL << PWMA_SM2CAPTCOMPA_EDGCMPA_SHIFT)         /*!< PWMA_SM2CAPTCOMPA: EDGCMPA Mask         */
#define PWMA_SM2CAPTCOMPA_EDGCMPA_SHIFT          0                                                   /*!< PWMA_SM2CAPTCOMPA: EDGCMPA Position     */
#define PWMA_SM2CAPTCOMPA_EDGCMPA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPA_EDGCMPA_SHIFT))&PWMA_SM2CAPTCOMPA_EDGCMPA_MASK) /*!< PWMA_SM2CAPTCOMPA                       */
#define PWMA_SM2CAPTCOMPA_EDGCNTA_MASK           (0xFFUL << PWMA_SM2CAPTCOMPA_EDGCNTA_SHIFT)         /*!< PWMA_SM2CAPTCOMPA: EDGCNTA Mask         */
#define PWMA_SM2CAPTCOMPA_EDGCNTA_SHIFT          8                                                   /*!< PWMA_SM2CAPTCOMPA: EDGCNTA Position     */
#define PWMA_SM2CAPTCOMPA_EDGCNTA(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPA_EDGCNTA_SHIFT))&PWMA_SM2CAPTCOMPA_EDGCNTA_MASK) /*!< PWMA_SM2CAPTCOMPA                       */
/* ------- SM2CAPTCTRLB Bit Fields                  ------ */
#define PWMA_SM2CAPTCTRLB_ARMB_MASK              (0x01UL << PWMA_SM2CAPTCTRLB_ARMB_SHIFT)            /*!< PWMA_SM2CAPTCTRLB: ARMB Mask            */
#define PWMA_SM2CAPTCTRLB_ARMB_SHIFT             0                                                   /*!< PWMA_SM2CAPTCTRLB: ARMB Position        */
#define PWMA_SM2CAPTCTRLB_ARMB(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_ARMB_SHIFT))&PWMA_SM2CAPTCTRLB_ARMB_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_ONESHOTB_MASK          (0x01UL << PWMA_SM2CAPTCTRLB_ONESHOTB_SHIFT)        /*!< PWMA_SM2CAPTCTRLB: ONESHOTB Mask        */
#define PWMA_SM2CAPTCTRLB_ONESHOTB_SHIFT         1                                                   /*!< PWMA_SM2CAPTCTRLB: ONESHOTB Position    */
#define PWMA_SM2CAPTCTRLB_ONESHOTB(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_ONESHOTB_SHIFT))&PWMA_SM2CAPTCTRLB_ONESHOTB_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_EDGB0_MASK             (0x03UL << PWMA_SM2CAPTCTRLB_EDGB0_SHIFT)           /*!< PWMA_SM2CAPTCTRLB: EDGB0 Mask           */
#define PWMA_SM2CAPTCTRLB_EDGB0_SHIFT            2                                                   /*!< PWMA_SM2CAPTCTRLB: EDGB0 Position       */
#define PWMA_SM2CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_EDGB0_SHIFT))&PWMA_SM2CAPTCTRLB_EDGB0_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_EDGB1_MASK             (0x03UL << PWMA_SM2CAPTCTRLB_EDGB1_SHIFT)           /*!< PWMA_SM2CAPTCTRLB: EDGB1 Mask           */
#define PWMA_SM2CAPTCTRLB_EDGB1_SHIFT            4                                                   /*!< PWMA_SM2CAPTCTRLB: EDGB1 Position       */
#define PWMA_SM2CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_EDGB1_SHIFT))&PWMA_SM2CAPTCTRLB_EDGB1_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_INP_SELB_MASK          (0x01UL << PWMA_SM2CAPTCTRLB_INP_SELB_SHIFT)        /*!< PWMA_SM2CAPTCTRLB: INP_SELB Mask        */
#define PWMA_SM2CAPTCTRLB_INP_SELB_SHIFT         6                                                   /*!< PWMA_SM2CAPTCTRLB: INP_SELB Position    */
#define PWMA_SM2CAPTCTRLB_INP_SELB(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_INP_SELB_SHIFT))&PWMA_SM2CAPTCTRLB_INP_SELB_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_EDGCNTB_EN_MASK        (0x01UL << PWMA_SM2CAPTCTRLB_EDGCNTB_EN_SHIFT)      /*!< PWMA_SM2CAPTCTRLB: EDGCNTB_EN Mask      */
#define PWMA_SM2CAPTCTRLB_EDGCNTB_EN_SHIFT       7                                                   /*!< PWMA_SM2CAPTCTRLB: EDGCNTB_EN Position  */
#define PWMA_SM2CAPTCTRLB_EDGCNTB_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_EDGCNTB_EN_SHIFT))&PWMA_SM2CAPTCTRLB_EDGCNTB_EN_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_CFBWM_MASK             (0x03UL << PWMA_SM2CAPTCTRLB_CFBWM_SHIFT)           /*!< PWMA_SM2CAPTCTRLB: CFBWM Mask           */
#define PWMA_SM2CAPTCTRLB_CFBWM_SHIFT            8                                                   /*!< PWMA_SM2CAPTCTRLB: CFBWM Position       */
#define PWMA_SM2CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_CFBWM_SHIFT))&PWMA_SM2CAPTCTRLB_CFBWM_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_CB0CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLB_CB0CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLB: CB0CNT Mask          */
#define PWMA_SM2CAPTCTRLB_CB0CNT_SHIFT           10                                                  /*!< PWMA_SM2CAPTCTRLB: CB0CNT Position      */
#define PWMA_SM2CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_CB0CNT_SHIFT))&PWMA_SM2CAPTCTRLB_CB0CNT_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
#define PWMA_SM2CAPTCTRLB_CB1CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLB_CB1CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLB: CB1CNT Mask          */
#define PWMA_SM2CAPTCTRLB_CB1CNT_SHIFT           13                                                  /*!< PWMA_SM2CAPTCTRLB: CB1CNT Position      */
#define PWMA_SM2CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLB_CB1CNT_SHIFT))&PWMA_SM2CAPTCTRLB_CB1CNT_MASK) /*!< PWMA_SM2CAPTCTRLB                       */
/* ------- SM2CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM2CAPTCOMPB_EDGCMPB_MASK           (0xFFUL << PWMA_SM2CAPTCOMPB_EDGCMPB_SHIFT)         /*!< PWMA_SM2CAPTCOMPB: EDGCMPB Mask         */
#define PWMA_SM2CAPTCOMPB_EDGCMPB_SHIFT          0                                                   /*!< PWMA_SM2CAPTCOMPB: EDGCMPB Position     */
#define PWMA_SM2CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPB_EDGCMPB_SHIFT))&PWMA_SM2CAPTCOMPB_EDGCMPB_MASK) /*!< PWMA_SM2CAPTCOMPB                       */
#define PWMA_SM2CAPTCOMPB_EDGCNTB_MASK           (0xFFUL << PWMA_SM2CAPTCOMPB_EDGCNTB_SHIFT)         /*!< PWMA_SM2CAPTCOMPB: EDGCNTB Mask         */
#define PWMA_SM2CAPTCOMPB_EDGCNTB_SHIFT          8                                                   /*!< PWMA_SM2CAPTCOMPB: EDGCNTB Position     */
#define PWMA_SM2CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPB_EDGCNTB_SHIFT))&PWMA_SM2CAPTCOMPB_EDGCNTB_MASK) /*!< PWMA_SM2CAPTCOMPB                       */
/* ------- SM2CAPTCTRLX Bit Fields                  ------ */
#define PWMA_SM2CAPTCTRLX_ARMX_MASK              (0x01UL << PWMA_SM2CAPTCTRLX_ARMX_SHIFT)            /*!< PWMA_SM2CAPTCTRLX: ARMX Mask            */
#define PWMA_SM2CAPTCTRLX_ARMX_SHIFT             0                                                   /*!< PWMA_SM2CAPTCTRLX: ARMX Position        */
#define PWMA_SM2CAPTCTRLX_ARMX(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_ARMX_SHIFT))&PWMA_SM2CAPTCTRLX_ARMX_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_ONESHOTX_MASK          (0x01UL << PWMA_SM2CAPTCTRLX_ONESHOTX_SHIFT)        /*!< PWMA_SM2CAPTCTRLX: ONESHOTX Mask        */
#define PWMA_SM2CAPTCTRLX_ONESHOTX_SHIFT         1                                                   /*!< PWMA_SM2CAPTCTRLX: ONESHOTX Position    */
#define PWMA_SM2CAPTCTRLX_ONESHOTX(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_ONESHOTX_SHIFT))&PWMA_SM2CAPTCTRLX_ONESHOTX_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_EDGX0_MASK             (0x03UL << PWMA_SM2CAPTCTRLX_EDGX0_SHIFT)           /*!< PWMA_SM2CAPTCTRLX: EDGX0 Mask           */
#define PWMA_SM2CAPTCTRLX_EDGX0_SHIFT            2                                                   /*!< PWMA_SM2CAPTCTRLX: EDGX0 Position       */
#define PWMA_SM2CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_EDGX0_SHIFT))&PWMA_SM2CAPTCTRLX_EDGX0_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_EDGX1_MASK             (0x03UL << PWMA_SM2CAPTCTRLX_EDGX1_SHIFT)           /*!< PWMA_SM2CAPTCTRLX: EDGX1 Mask           */
#define PWMA_SM2CAPTCTRLX_EDGX1_SHIFT            4                                                   /*!< PWMA_SM2CAPTCTRLX: EDGX1 Position       */
#define PWMA_SM2CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_EDGX1_SHIFT))&PWMA_SM2CAPTCTRLX_EDGX1_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_INP_SELX_MASK          (0x01UL << PWMA_SM2CAPTCTRLX_INP_SELX_SHIFT)        /*!< PWMA_SM2CAPTCTRLX: INP_SELX Mask        */
#define PWMA_SM2CAPTCTRLX_INP_SELX_SHIFT         6                                                   /*!< PWMA_SM2CAPTCTRLX: INP_SELX Position    */
#define PWMA_SM2CAPTCTRLX_INP_SELX(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_INP_SELX_SHIFT))&PWMA_SM2CAPTCTRLX_INP_SELX_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_EDGCNTX_EN_MASK        (0x01UL << PWMA_SM2CAPTCTRLX_EDGCNTX_EN_SHIFT)      /*!< PWMA_SM2CAPTCTRLX: EDGCNTX_EN Mask      */
#define PWMA_SM2CAPTCTRLX_EDGCNTX_EN_SHIFT       7                                                   /*!< PWMA_SM2CAPTCTRLX: EDGCNTX_EN Position  */
#define PWMA_SM2CAPTCTRLX_EDGCNTX_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_EDGCNTX_EN_SHIFT))&PWMA_SM2CAPTCTRLX_EDGCNTX_EN_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_CFXWM_MASK             (0x03UL << PWMA_SM2CAPTCTRLX_CFXWM_SHIFT)           /*!< PWMA_SM2CAPTCTRLX: CFXWM Mask           */
#define PWMA_SM2CAPTCTRLX_CFXWM_SHIFT            8                                                   /*!< PWMA_SM2CAPTCTRLX: CFXWM Position       */
#define PWMA_SM2CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_CFXWM_SHIFT))&PWMA_SM2CAPTCTRLX_CFXWM_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_CX0CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLX_CX0CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLX: CX0CNT Mask          */
#define PWMA_SM2CAPTCTRLX_CX0CNT_SHIFT           10                                                  /*!< PWMA_SM2CAPTCTRLX: CX0CNT Position      */
#define PWMA_SM2CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_CX0CNT_SHIFT))&PWMA_SM2CAPTCTRLX_CX0CNT_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
#define PWMA_SM2CAPTCTRLX_CX1CNT_MASK            (0x07UL << PWMA_SM2CAPTCTRLX_CX1CNT_SHIFT)          /*!< PWMA_SM2CAPTCTRLX: CX1CNT Mask          */
#define PWMA_SM2CAPTCTRLX_CX1CNT_SHIFT           13                                                  /*!< PWMA_SM2CAPTCTRLX: CX1CNT Position      */
#define PWMA_SM2CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCTRLX_CX1CNT_SHIFT))&PWMA_SM2CAPTCTRLX_CX1CNT_MASK) /*!< PWMA_SM2CAPTCTRLX                       */
/* ------- SM2CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM2CAPTCOMPX_EDGCMPX_MASK           (0xFFUL << PWMA_SM2CAPTCOMPX_EDGCMPX_SHIFT)         /*!< PWMA_SM2CAPTCOMPX: EDGCMPX Mask         */
#define PWMA_SM2CAPTCOMPX_EDGCMPX_SHIFT          0                                                   /*!< PWMA_SM2CAPTCOMPX: EDGCMPX Position     */
#define PWMA_SM2CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPX_EDGCMPX_SHIFT))&PWMA_SM2CAPTCOMPX_EDGCMPX_MASK) /*!< PWMA_SM2CAPTCOMPX                       */
#define PWMA_SM2CAPTCOMPX_EDGCNTX_MASK           (0xFFUL << PWMA_SM2CAPTCOMPX_EDGCNTX_SHIFT)         /*!< PWMA_SM2CAPTCOMPX: EDGCNTX Mask         */
#define PWMA_SM2CAPTCOMPX_EDGCNTX_SHIFT          8                                                   /*!< PWMA_SM2CAPTCOMPX: EDGCNTX Position     */
#define PWMA_SM2CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CAPTCOMPX_EDGCNTX_SHIFT))&PWMA_SM2CAPTCOMPX_EDGCNTX_MASK) /*!< PWMA_SM2CAPTCOMPX                       */
/* ------- SM2CVAL0 Bit Fields                      ------ */
#define PWMA_SM2CVAL0_CAPTVAL0_MASK              (0xFFFFUL << PWMA_SM2CVAL0_CAPTVAL0_SHIFT)          /*!< PWMA_SM2CVAL0: CAPTVAL0 Mask            */
#define PWMA_SM2CVAL0_CAPTVAL0_SHIFT             0                                                   /*!< PWMA_SM2CVAL0: CAPTVAL0 Position        */
#define PWMA_SM2CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL0_CAPTVAL0_SHIFT))&PWMA_SM2CVAL0_CAPTVAL0_MASK) /*!< PWMA_SM2CVAL0                           */
/* ------- SM2CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL0CYC_CVAL0CYC_MASK           (0x0FUL << PWMA_SM2CVAL0CYC_CVAL0CYC_SHIFT)         /*!< PWMA_SM2CVAL0CYC: CVAL0CYC Mask         */
#define PWMA_SM2CVAL0CYC_CVAL0CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL0CYC: CVAL0CYC Position     */
#define PWMA_SM2CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL0CYC_CVAL0CYC_SHIFT))&PWMA_SM2CVAL0CYC_CVAL0CYC_MASK) /*!< PWMA_SM2CVAL0CYC                        */
/* ------- SM2CVAL1 Bit Fields                      ------ */
#define PWMA_SM2CVAL1_CAPTVAL1_MASK              (0xFFFFUL << PWMA_SM2CVAL1_CAPTVAL1_SHIFT)          /*!< PWMA_SM2CVAL1: CAPTVAL1 Mask            */
#define PWMA_SM2CVAL1_CAPTVAL1_SHIFT             0                                                   /*!< PWMA_SM2CVAL1: CAPTVAL1 Position        */
#define PWMA_SM2CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL1_CAPTVAL1_SHIFT))&PWMA_SM2CVAL1_CAPTVAL1_MASK) /*!< PWMA_SM2CVAL1                           */
/* ------- SM2CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL1CYC_CVAL1CYC_MASK           (0x0FUL << PWMA_SM2CVAL1CYC_CVAL1CYC_SHIFT)         /*!< PWMA_SM2CVAL1CYC: CVAL1CYC Mask         */
#define PWMA_SM2CVAL1CYC_CVAL1CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL1CYC: CVAL1CYC Position     */
#define PWMA_SM2CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL1CYC_CVAL1CYC_SHIFT))&PWMA_SM2CVAL1CYC_CVAL1CYC_MASK) /*!< PWMA_SM2CVAL1CYC                        */
/* ------- SM2CVAL2 Bit Fields                      ------ */
#define PWMA_SM2CVAL2_CAPTVAL2_MASK              (0xFFFFUL << PWMA_SM2CVAL2_CAPTVAL2_SHIFT)          /*!< PWMA_SM2CVAL2: CAPTVAL2 Mask            */
#define PWMA_SM2CVAL2_CAPTVAL2_SHIFT             0                                                   /*!< PWMA_SM2CVAL2: CAPTVAL2 Position        */
#define PWMA_SM2CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL2_CAPTVAL2_SHIFT))&PWMA_SM2CVAL2_CAPTVAL2_MASK) /*!< PWMA_SM2CVAL2                           */
/* ------- SM2CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL2CYC_CVAL2CYC_MASK           (0x0FUL << PWMA_SM2CVAL2CYC_CVAL2CYC_SHIFT)         /*!< PWMA_SM2CVAL2CYC: CVAL2CYC Mask         */
#define PWMA_SM2CVAL2CYC_CVAL2CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL2CYC: CVAL2CYC Position     */
#define PWMA_SM2CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL2CYC_CVAL2CYC_SHIFT))&PWMA_SM2CVAL2CYC_CVAL2CYC_MASK) /*!< PWMA_SM2CVAL2CYC                        */
/* ------- SM2CVAL3 Bit Fields                      ------ */
#define PWMA_SM2CVAL3_CAPTVAL3_MASK              (0xFFFFUL << PWMA_SM2CVAL3_CAPTVAL3_SHIFT)          /*!< PWMA_SM2CVAL3: CAPTVAL3 Mask            */
#define PWMA_SM2CVAL3_CAPTVAL3_SHIFT             0                                                   /*!< PWMA_SM2CVAL3: CAPTVAL3 Position        */
#define PWMA_SM2CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL3_CAPTVAL3_SHIFT))&PWMA_SM2CVAL3_CAPTVAL3_MASK) /*!< PWMA_SM2CVAL3                           */
/* ------- SM2CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL3CYC_CVAL3CYC_MASK           (0x0FUL << PWMA_SM2CVAL3CYC_CVAL3CYC_SHIFT)         /*!< PWMA_SM2CVAL3CYC: CVAL3CYC Mask         */
#define PWMA_SM2CVAL3CYC_CVAL3CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL3CYC: CVAL3CYC Position     */
#define PWMA_SM2CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL3CYC_CVAL3CYC_SHIFT))&PWMA_SM2CVAL3CYC_CVAL3CYC_MASK) /*!< PWMA_SM2CVAL3CYC                        */
/* ------- SM2CVAL4 Bit Fields                      ------ */
#define PWMA_SM2CVAL4_CAPTVAL4_MASK              (0xFFFFUL << PWMA_SM2CVAL4_CAPTVAL4_SHIFT)          /*!< PWMA_SM2CVAL4: CAPTVAL4 Mask            */
#define PWMA_SM2CVAL4_CAPTVAL4_SHIFT             0                                                   /*!< PWMA_SM2CVAL4: CAPTVAL4 Position        */
#define PWMA_SM2CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL4_CAPTVAL4_SHIFT))&PWMA_SM2CVAL4_CAPTVAL4_MASK) /*!< PWMA_SM2CVAL4                           */
/* ------- SM2CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM2CVAL4CYC_CVAL4CYC_MASK           (0x0FUL << PWMA_SM2CVAL4CYC_CVAL4CYC_SHIFT)         /*!< PWMA_SM2CVAL4CYC: CVAL4CYC Mask         */
#define PWMA_SM2CVAL4CYC_CVAL4CYC_SHIFT          0                                                   /*!< PWMA_SM2CVAL4CYC: CVAL4CYC Position     */
#define PWMA_SM2CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL4CYC_CVAL4CYC_SHIFT))&PWMA_SM2CVAL4CYC_CVAL4CYC_MASK) /*!< PWMA_SM2CVAL4CYC                        */
/* ------- SM2CVAL5 Bit Fields                      ------ */
#define PWMA_SM2CVAL5_CAPTVAL5_MASK              (0xFFFFUL << PWMA_SM2CVAL5_CAPTVAL5_SHIFT)          /*!< PWMA_SM2CVAL5: CAPTVAL5 Mask            */
#define PWMA_SM2CVAL5_CAPTVAL5_SHIFT             0                                                   /*!< PWMA_SM2CVAL5: CAPTVAL5 Position        */
#define PWMA_SM2CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM2CVAL5_CAPTVAL5_SHIFT))&PWMA_SM2CVAL5_CAPTVAL5_MASK) /*!< PWMA_SM2CVAL5                           */
