podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F15.h
#define PWMA_SM3CAPTCTRLB_EDGB0_MASK             (0x03UL << PWMA_SM3CAPTCTRLB_EDGB0_SHIFT)           /*!< PWMA_SM3CAPTCTRLB: EDGB0 Mask           */
#define PWMA_SM3CAPTCTRLB_EDGB0_SHIFT            2                                                   /*!< PWMA_SM3CAPTCTRLB: EDGB0 Position       */
#define PWMA_SM3CAPTCTRLB_EDGB0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLB_EDGB0_SHIFT))&PWMA_SM3CAPTCTRLB_EDGB0_MASK) /*!< PWMA_SM3CAPTCTRLB                       */
#define PWMA_SM3CAPTCTRLB_EDGB1_MASK             (0x03UL << PWMA_SM3CAPTCTRLB_EDGB1_SHIFT)           /*!< PWMA_SM3CAPTCTRLB: EDGB1 Mask           */
#define PWMA_SM3CAPTCTRLB_EDGB1_SHIFT            4                                                   /*!< PWMA_SM3CAPTCTRLB: EDGB1 Position       */
#define PWMA_SM3CAPTCTRLB_EDGB1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLB_EDGB1_SHIFT))&PWMA_SM3CAPTCTRLB_EDGB1_MASK) /*!< PWMA_SM3CAPTCTRLB                       */
#define PWMA_SM3CAPTCTRLB_INP_SELB_MASK          (0x01UL << PWMA_SM3CAPTCTRLB_INP_SELB_SHIFT)        /*!< PWMA_SM3CAPTCTRLB: INP_SELB Mask        */
#define PWMA_SM3CAPTCTRLB_INP_SELB_SHIFT         6                                                   /*!< PWMA_SM3CAPTCTRLB: INP_SELB Position    */
#define PWMA_SM3CAPTCTRLB_INP_SELB(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLB_INP_SELB_SHIFT))&PWMA_SM3CAPTCTRLB_INP_SELB_MASK) /*!< PWMA_SM3CAPTCTRLB                       */
#define PWMA_SM3CAPTCTRLB_EDGCNTB_EN_MASK        (0x01UL << PWMA_SM3CAPTCTRLB_EDGCNTB_EN_SHIFT)      /*!< PWMA_SM3CAPTCTRLB: EDGCNTB_EN Mask      */
#define PWMA_SM3CAPTCTRLB_EDGCNTB_EN_SHIFT       7                                                   /*!< PWMA_SM3CAPTCTRLB: EDGCNTB_EN Position  */
#define PWMA_SM3CAPTCTRLB_EDGCNTB_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLB_EDGCNTB_EN_SHIFT))&PWMA_SM3CAPTCTRLB_EDGCNTB_EN_MASK) /*!< PWMA_SM3CAPTCTRLB                       */
#define PWMA_SM3CAPTCTRLB_CFBWM_MASK             (0x03UL << PWMA_SM3CAPTCTRLB_CFBWM_SHIFT)           /*!< PWMA_SM3CAPTCTRLB: CFBWM Mask           */
#define PWMA_SM3CAPTCTRLB_CFBWM_SHIFT            8                                                   /*!< PWMA_SM3CAPTCTRLB: CFBWM Position       */
#define PWMA_SM3CAPTCTRLB_CFBWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLB_CFBWM_SHIFT))&PWMA_SM3CAPTCTRLB_CFBWM_MASK) /*!< PWMA_SM3CAPTCTRLB                       */
#define PWMA_SM3CAPTCTRLB_CB0CNT_MASK            (0x07UL << PWMA_SM3CAPTCTRLB_CB0CNT_SHIFT)          /*!< PWMA_SM3CAPTCTRLB: CB0CNT Mask          */
#define PWMA_SM3CAPTCTRLB_CB0CNT_SHIFT           10                                                  /*!< PWMA_SM3CAPTCTRLB: CB0CNT Position      */
#define PWMA_SM3CAPTCTRLB_CB0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLB_CB0CNT_SHIFT))&PWMA_SM3CAPTCTRLB_CB0CNT_MASK) /*!< PWMA_SM3CAPTCTRLB                       */
#define PWMA_SM3CAPTCTRLB_CB1CNT_MASK            (0x07UL << PWMA_SM3CAPTCTRLB_CB1CNT_SHIFT)          /*!< PWMA_SM3CAPTCTRLB: CB1CNT Mask          */
#define PWMA_SM3CAPTCTRLB_CB1CNT_SHIFT           13                                                  /*!< PWMA_SM3CAPTCTRLB: CB1CNT Position      */
#define PWMA_SM3CAPTCTRLB_CB1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLB_CB1CNT_SHIFT))&PWMA_SM3CAPTCTRLB_CB1CNT_MASK) /*!< PWMA_SM3CAPTCTRLB                       */
/* ------- SM3CAPTCOMPB Bit Fields                  ------ */
#define PWMA_SM3CAPTCOMPB_EDGCMPB_MASK           (0xFFUL << PWMA_SM3CAPTCOMPB_EDGCMPB_SHIFT)         /*!< PWMA_SM3CAPTCOMPB: EDGCMPB Mask         */
#define PWMA_SM3CAPTCOMPB_EDGCMPB_SHIFT          0                                                   /*!< PWMA_SM3CAPTCOMPB: EDGCMPB Position     */
#define PWMA_SM3CAPTCOMPB_EDGCMPB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCOMPB_EDGCMPB_SHIFT))&PWMA_SM3CAPTCOMPB_EDGCMPB_MASK) /*!< PWMA_SM3CAPTCOMPB                       */
#define PWMA_SM3CAPTCOMPB_EDGCNTB_MASK           (0xFFUL << PWMA_SM3CAPTCOMPB_EDGCNTB_SHIFT)         /*!< PWMA_SM3CAPTCOMPB: EDGCNTB Mask         */
#define PWMA_SM3CAPTCOMPB_EDGCNTB_SHIFT          8                                                   /*!< PWMA_SM3CAPTCOMPB: EDGCNTB Position     */
#define PWMA_SM3CAPTCOMPB_EDGCNTB(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCOMPB_EDGCNTB_SHIFT))&PWMA_SM3CAPTCOMPB_EDGCNTB_MASK) /*!< PWMA_SM3CAPTCOMPB                       */
/* ------- SM3CAPTCTRLX Bit Fields                  ------ */
#define PWMA_SM3CAPTCTRLX_ARMX_MASK              (0x01UL << PWMA_SM3CAPTCTRLX_ARMX_SHIFT)            /*!< PWMA_SM3CAPTCTRLX: ARMX Mask            */
#define PWMA_SM3CAPTCTRLX_ARMX_SHIFT             0                                                   /*!< PWMA_SM3CAPTCTRLX: ARMX Position        */
#define PWMA_SM3CAPTCTRLX_ARMX(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_ARMX_SHIFT))&PWMA_SM3CAPTCTRLX_ARMX_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
#define PWMA_SM3CAPTCTRLX_ONESHOTX_MASK          (0x01UL << PWMA_SM3CAPTCTRLX_ONESHOTX_SHIFT)        /*!< PWMA_SM3CAPTCTRLX: ONESHOTX Mask        */
#define PWMA_SM3CAPTCTRLX_ONESHOTX_SHIFT         1                                                   /*!< PWMA_SM3CAPTCTRLX: ONESHOTX Position    */
#define PWMA_SM3CAPTCTRLX_ONESHOTX(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_ONESHOTX_SHIFT))&PWMA_SM3CAPTCTRLX_ONESHOTX_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
#define PWMA_SM3CAPTCTRLX_EDGX0_MASK             (0x03UL << PWMA_SM3CAPTCTRLX_EDGX0_SHIFT)           /*!< PWMA_SM3CAPTCTRLX: EDGX0 Mask           */
#define PWMA_SM3CAPTCTRLX_EDGX0_SHIFT            2                                                   /*!< PWMA_SM3CAPTCTRLX: EDGX0 Position       */
#define PWMA_SM3CAPTCTRLX_EDGX0(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_EDGX0_SHIFT))&PWMA_SM3CAPTCTRLX_EDGX0_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
#define PWMA_SM3CAPTCTRLX_EDGX1_MASK             (0x03UL << PWMA_SM3CAPTCTRLX_EDGX1_SHIFT)           /*!< PWMA_SM3CAPTCTRLX: EDGX1 Mask           */
#define PWMA_SM3CAPTCTRLX_EDGX1_SHIFT            4                                                   /*!< PWMA_SM3CAPTCTRLX: EDGX1 Position       */
#define PWMA_SM3CAPTCTRLX_EDGX1(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_EDGX1_SHIFT))&PWMA_SM3CAPTCTRLX_EDGX1_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
#define PWMA_SM3CAPTCTRLX_INP_SELX_MASK          (0x01UL << PWMA_SM3CAPTCTRLX_INP_SELX_SHIFT)        /*!< PWMA_SM3CAPTCTRLX: INP_SELX Mask        */
#define PWMA_SM3CAPTCTRLX_INP_SELX_SHIFT         6                                                   /*!< PWMA_SM3CAPTCTRLX: INP_SELX Position    */
#define PWMA_SM3CAPTCTRLX_INP_SELX(x)            (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_INP_SELX_SHIFT))&PWMA_SM3CAPTCTRLX_INP_SELX_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
#define PWMA_SM3CAPTCTRLX_EDGCNTX_EN_MASK        (0x01UL << PWMA_SM3CAPTCTRLX_EDGCNTX_EN_SHIFT)      /*!< PWMA_SM3CAPTCTRLX: EDGCNTX_EN Mask      */
#define PWMA_SM3CAPTCTRLX_EDGCNTX_EN_SHIFT       7                                                   /*!< PWMA_SM3CAPTCTRLX: EDGCNTX_EN Position  */
#define PWMA_SM3CAPTCTRLX_EDGCNTX_EN(x)          (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_EDGCNTX_EN_SHIFT))&PWMA_SM3CAPTCTRLX_EDGCNTX_EN_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
#define PWMA_SM3CAPTCTRLX_CFXWM_MASK             (0x03UL << PWMA_SM3CAPTCTRLX_CFXWM_SHIFT)           /*!< PWMA_SM3CAPTCTRLX: CFXWM Mask           */
#define PWMA_SM3CAPTCTRLX_CFXWM_SHIFT            8                                                   /*!< PWMA_SM3CAPTCTRLX: CFXWM Position       */
#define PWMA_SM3CAPTCTRLX_CFXWM(x)               (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_CFXWM_SHIFT))&PWMA_SM3CAPTCTRLX_CFXWM_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
#define PWMA_SM3CAPTCTRLX_CX0CNT_MASK            (0x07UL << PWMA_SM3CAPTCTRLX_CX0CNT_SHIFT)          /*!< PWMA_SM3CAPTCTRLX: CX0CNT Mask          */
#define PWMA_SM3CAPTCTRLX_CX0CNT_SHIFT           10                                                  /*!< PWMA_SM3CAPTCTRLX: CX0CNT Position      */
#define PWMA_SM3CAPTCTRLX_CX0CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_CX0CNT_SHIFT))&PWMA_SM3CAPTCTRLX_CX0CNT_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
#define PWMA_SM3CAPTCTRLX_CX1CNT_MASK            (0x07UL << PWMA_SM3CAPTCTRLX_CX1CNT_SHIFT)          /*!< PWMA_SM3CAPTCTRLX: CX1CNT Mask          */
#define PWMA_SM3CAPTCTRLX_CX1CNT_SHIFT           13                                                  /*!< PWMA_SM3CAPTCTRLX: CX1CNT Position      */
#define PWMA_SM3CAPTCTRLX_CX1CNT(x)              (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCTRLX_CX1CNT_SHIFT))&PWMA_SM3CAPTCTRLX_CX1CNT_MASK) /*!< PWMA_SM3CAPTCTRLX                       */
/* ------- SM3CAPTCOMPX Bit Fields                  ------ */
#define PWMA_SM3CAPTCOMPX_EDGCMPX_MASK           (0xFFUL << PWMA_SM3CAPTCOMPX_EDGCMPX_SHIFT)         /*!< PWMA_SM3CAPTCOMPX: EDGCMPX Mask         */
#define PWMA_SM3CAPTCOMPX_EDGCMPX_SHIFT          0                                                   /*!< PWMA_SM3CAPTCOMPX: EDGCMPX Position     */
#define PWMA_SM3CAPTCOMPX_EDGCMPX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCOMPX_EDGCMPX_SHIFT))&PWMA_SM3CAPTCOMPX_EDGCMPX_MASK) /*!< PWMA_SM3CAPTCOMPX                       */
#define PWMA_SM3CAPTCOMPX_EDGCNTX_MASK           (0xFFUL << PWMA_SM3CAPTCOMPX_EDGCNTX_SHIFT)         /*!< PWMA_SM3CAPTCOMPX: EDGCNTX Mask         */
#define PWMA_SM3CAPTCOMPX_EDGCNTX_SHIFT          8                                                   /*!< PWMA_SM3CAPTCOMPX: EDGCNTX Position     */
#define PWMA_SM3CAPTCOMPX_EDGCNTX(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CAPTCOMPX_EDGCNTX_SHIFT))&PWMA_SM3CAPTCOMPX_EDGCNTX_MASK) /*!< PWMA_SM3CAPTCOMPX                       */
/* ------- SM3CVAL0 Bit Fields                      ------ */
#define PWMA_SM3CVAL0_CAPTVAL0_MASK              (0xFFFFUL << PWMA_SM3CVAL0_CAPTVAL0_SHIFT)          /*!< PWMA_SM3CVAL0: CAPTVAL0 Mask            */
#define PWMA_SM3CVAL0_CAPTVAL0_SHIFT             0                                                   /*!< PWMA_SM3CVAL0: CAPTVAL0 Position        */
#define PWMA_SM3CVAL0_CAPTVAL0(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL0_CAPTVAL0_SHIFT))&PWMA_SM3CVAL0_CAPTVAL0_MASK) /*!< PWMA_SM3CVAL0                           */
/* ------- SM3CVAL0CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL0CYC_CVAL0CYC_MASK           (0x0FUL << PWMA_SM3CVAL0CYC_CVAL0CYC_SHIFT)         /*!< PWMA_SM3CVAL0CYC: CVAL0CYC Mask         */
#define PWMA_SM3CVAL0CYC_CVAL0CYC_SHIFT          0                                                   /*!< PWMA_SM3CVAL0CYC: CVAL0CYC Position     */
#define PWMA_SM3CVAL0CYC_CVAL0CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL0CYC_CVAL0CYC_SHIFT))&PWMA_SM3CVAL0CYC_CVAL0CYC_MASK) /*!< PWMA_SM3CVAL0CYC                        */
/* ------- SM3CVAL1 Bit Fields                      ------ */
#define PWMA_SM3CVAL1_CAPTVAL1_MASK              (0xFFFFUL << PWMA_SM3CVAL1_CAPTVAL1_SHIFT)          /*!< PWMA_SM3CVAL1: CAPTVAL1 Mask            */
#define PWMA_SM3CVAL1_CAPTVAL1_SHIFT             0                                                   /*!< PWMA_SM3CVAL1: CAPTVAL1 Position        */
#define PWMA_SM3CVAL1_CAPTVAL1(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL1_CAPTVAL1_SHIFT))&PWMA_SM3CVAL1_CAPTVAL1_MASK) /*!< PWMA_SM3CVAL1                           */
/* ------- SM3CVAL1CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL1CYC_CVAL1CYC_MASK           (0x0FUL << PWMA_SM3CVAL1CYC_CVAL1CYC_SHIFT)         /*!< PWMA_SM3CVAL1CYC: CVAL1CYC Mask         */
#define PWMA_SM3CVAL1CYC_CVAL1CYC_SHIFT          0                                                   /*!< PWMA_SM3CVAL1CYC: CVAL1CYC Position     */
#define PWMA_SM3CVAL1CYC_CVAL1CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL1CYC_CVAL1CYC_SHIFT))&PWMA_SM3CVAL1CYC_CVAL1CYC_MASK) /*!< PWMA_SM3CVAL1CYC                        */
/* ------- SM3CVAL2 Bit Fields                      ------ */
#define PWMA_SM3CVAL2_CAPTVAL2_MASK              (0xFFFFUL << PWMA_SM3CVAL2_CAPTVAL2_SHIFT)          /*!< PWMA_SM3CVAL2: CAPTVAL2 Mask            */
#define PWMA_SM3CVAL2_CAPTVAL2_SHIFT             0                                                   /*!< PWMA_SM3CVAL2: CAPTVAL2 Position        */
#define PWMA_SM3CVAL2_CAPTVAL2(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL2_CAPTVAL2_SHIFT))&PWMA_SM3CVAL2_CAPTVAL2_MASK) /*!< PWMA_SM3CVAL2                           */
/* ------- SM3CVAL2CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL2CYC_CVAL2CYC_MASK           (0x0FUL << PWMA_SM3CVAL2CYC_CVAL2CYC_SHIFT)         /*!< PWMA_SM3CVAL2CYC: CVAL2CYC Mask         */
#define PWMA_SM3CVAL2CYC_CVAL2CYC_SHIFT          0                                                   /*!< PWMA_SM3CVAL2CYC: CVAL2CYC Position     */
#define PWMA_SM3CVAL2CYC_CVAL2CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL2CYC_CVAL2CYC_SHIFT))&PWMA_SM3CVAL2CYC_CVAL2CYC_MASK) /*!< PWMA_SM3CVAL2CYC                        */
/* ------- SM3CVAL3 Bit Fields                      ------ */
#define PWMA_SM3CVAL3_CAPTVAL3_MASK              (0xFFFFUL << PWMA_SM3CVAL3_CAPTVAL3_SHIFT)          /*!< PWMA_SM3CVAL3: CAPTVAL3 Mask            */
#define PWMA_SM3CVAL3_CAPTVAL3_SHIFT             0                                                   /*!< PWMA_SM3CVAL3: CAPTVAL3 Position        */
#define PWMA_SM3CVAL3_CAPTVAL3(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL3_CAPTVAL3_SHIFT))&PWMA_SM3CVAL3_CAPTVAL3_MASK) /*!< PWMA_SM3CVAL3                           */
/* ------- SM3CVAL3CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL3CYC_CVAL3CYC_MASK           (0x0FUL << PWMA_SM3CVAL3CYC_CVAL3CYC_SHIFT)         /*!< PWMA_SM3CVAL3CYC: CVAL3CYC Mask         */
#define PWMA_SM3CVAL3CYC_CVAL3CYC_SHIFT          0                                                   /*!< PWMA_SM3CVAL3CYC: CVAL3CYC Position     */
#define PWMA_SM3CVAL3CYC_CVAL3CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL3CYC_CVAL3CYC_SHIFT))&PWMA_SM3CVAL3CYC_CVAL3CYC_MASK) /*!< PWMA_SM3CVAL3CYC                        */
/* ------- SM3CVAL4 Bit Fields                      ------ */
#define PWMA_SM3CVAL4_CAPTVAL4_MASK              (0xFFFFUL << PWMA_SM3CVAL4_CAPTVAL4_SHIFT)          /*!< PWMA_SM3CVAL4: CAPTVAL4 Mask            */
#define PWMA_SM3CVAL4_CAPTVAL4_SHIFT             0                                                   /*!< PWMA_SM3CVAL4: CAPTVAL4 Position        */
#define PWMA_SM3CVAL4_CAPTVAL4(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL4_CAPTVAL4_SHIFT))&PWMA_SM3CVAL4_CAPTVAL4_MASK) /*!< PWMA_SM3CVAL4                           */
/* ------- SM3CVAL4CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL4CYC_CVAL4CYC_MASK           (0x0FUL << PWMA_SM3CVAL4CYC_CVAL4CYC_SHIFT)         /*!< PWMA_SM3CVAL4CYC: CVAL4CYC Mask         */
#define PWMA_SM3CVAL4CYC_CVAL4CYC_SHIFT          0                                                   /*!< PWMA_SM3CVAL4CYC: CVAL4CYC Position     */
#define PWMA_SM3CVAL4CYC_CVAL4CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL4CYC_CVAL4CYC_SHIFT))&PWMA_SM3CVAL4CYC_CVAL4CYC_MASK) /*!< PWMA_SM3CVAL4CYC                        */
/* ------- SM3CVAL5 Bit Fields                      ------ */
#define PWMA_SM3CVAL5_CAPTVAL5_MASK              (0xFFFFUL << PWMA_SM3CVAL5_CAPTVAL5_SHIFT)          /*!< PWMA_SM3CVAL5: CAPTVAL5 Mask            */
#define PWMA_SM3CVAL5_CAPTVAL5_SHIFT             0                                                   /*!< PWMA_SM3CVAL5: CAPTVAL5 Position        */
#define PWMA_SM3CVAL5_CAPTVAL5(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL5_CAPTVAL5_SHIFT))&PWMA_SM3CVAL5_CAPTVAL5_MASK) /*!< PWMA_SM3CVAL5                           */
/* ------- SM3CVAL5CYC Bit Fields                   ------ */
#define PWMA_SM3CVAL5CYC_CVAL5CYC_MASK           (0x0FUL << PWMA_SM3CVAL5CYC_CVAL5CYC_SHIFT)         /*!< PWMA_SM3CVAL5CYC: CVAL5CYC Mask         */
#define PWMA_SM3CVAL5CYC_CVAL5CYC_SHIFT          0                                                   /*!< PWMA_SM3CVAL5CYC: CVAL5CYC Position     */
#define PWMA_SM3CVAL5CYC_CVAL5CYC(x)             (((uint16_t)(((uint16_t)(x))<<PWMA_SM3CVAL5CYC_CVAL5CYC_SHIFT))&PWMA_SM3CVAL5CYC_CVAL5CYC_MASK) /*!< PWMA_SM3CVAL5CYC                        */
/* ------- OUTEN Bit Fields                         ------ */
#define PWMA_OUTEN_PWMX_EN_MASK                  (0x0FUL << PWMA_OUTEN_PWMX_EN_SHIFT)                /*!< PWMA_OUTEN: PWMX_EN Mask                */
#define PWMA_OUTEN_PWMX_EN_SHIFT                 0                                                   /*!< PWMA_OUTEN: PWMX_EN Position            */
#define PWMA_OUTEN_PWMX_EN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_OUTEN_PWMX_EN_SHIFT))&PWMA_OUTEN_PWMX_EN_MASK) /*!< PWMA_OUTEN                              */
#define PWMA_OUTEN_PWMB_EN_MASK                  (0x0FUL << PWMA_OUTEN_PWMB_EN_SHIFT)                /*!< PWMA_OUTEN: PWMB_EN Mask                */
#define PWMA_OUTEN_PWMB_EN_SHIFT                 4                                                   /*!< PWMA_OUTEN: PWMB_EN Position            */
#define PWMA_OUTEN_PWMB_EN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_OUTEN_PWMB_EN_SHIFT))&PWMA_OUTEN_PWMB_EN_MASK) /*!< PWMA_OUTEN                              */
#define PWMA_OUTEN_PWMA_EN_MASK                  (0x0FUL << PWMA_OUTEN_PWMA_EN_SHIFT)                /*!< PWMA_OUTEN: PWMA_EN Mask                */
#define PWMA_OUTEN_PWMA_EN_SHIFT                 8                                                   /*!< PWMA_OUTEN: PWMA_EN Position            */
#define PWMA_OUTEN_PWMA_EN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_OUTEN_PWMA_EN_SHIFT))&PWMA_OUTEN_PWMA_EN_MASK) /*!< PWMA_OUTEN                              */
/* ------- MASK Bit Fields                          ------ */
#define PWMA_MASK_MASKX_MASK                     (0x0FUL << PWMA_MASK_MASKX_SHIFT)                   /*!< PWMA_MASK: MASKX Mask                   */
#define PWMA_MASK_MASKX_SHIFT                    0                                                   /*!< PWMA_MASK: MASKX Position               */
#define PWMA_MASK_MASKX(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MASK_MASKX_SHIFT))&PWMA_MASK_MASKX_MASK) /*!< PWMA_MASK                               */
#define PWMA_MASK_MASKB_MASK                     (0x0FUL << PWMA_MASK_MASKB_SHIFT)                   /*!< PWMA_MASK: MASKB Mask                   */
#define PWMA_MASK_MASKB_SHIFT                    4                                                   /*!< PWMA_MASK: MASKB Position               */
#define PWMA_MASK_MASKB(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MASK_MASKB_SHIFT))&PWMA_MASK_MASKB_MASK) /*!< PWMA_MASK                               */
#define PWMA_MASK_MASKA_MASK                     (0x0FUL << PWMA_MASK_MASKA_SHIFT)                   /*!< PWMA_MASK: MASKA Mask                   */
#define PWMA_MASK_MASKA_SHIFT                    8                                                   /*!< PWMA_MASK: MASKA Position               */
#define PWMA_MASK_MASKA(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MASK_MASKA_SHIFT))&PWMA_MASK_MASKA_MASK) /*!< PWMA_MASK                               */
#define PWMA_MASK_UPDATE_MASK_MASK               (0x0FUL << PWMA_MASK_UPDATE_MASK_SHIFT)             /*!< PWMA_MASK: UPDATE_MASK Mask             */
#define PWMA_MASK_UPDATE_MASK_SHIFT              12                                                  /*!< PWMA_MASK: UPDATE_MASK Position         */
#define PWMA_MASK_UPDATE_MASK(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_MASK_UPDATE_MASK_SHIFT))&PWMA_MASK_UPDATE_MASK_MASK) /*!< PWMA_MASK                               */
/* ------- SWCOUT Bit Fields                        ------ */
#define PWMA_SWCOUT_SM0OUT45_MASK                (0x01UL << PWMA_SWCOUT_SM0OUT45_SHIFT)              /*!< PWMA_SWCOUT: SM0OUT45 Mask              */
#define PWMA_SWCOUT_SM0OUT45_SHIFT               0                                                   /*!< PWMA_SWCOUT: SM0OUT45 Position          */
#define PWMA_SWCOUT_SM0OUT45(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SWCOUT_SM0OUT45_SHIFT))&PWMA_SWCOUT_SM0OUT45_MASK) /*!< PWMA_SWCOUT                             */
#define PWMA_SWCOUT_SM0OUT23_MASK                (0x01UL << PWMA_SWCOUT_SM0OUT23_SHIFT)              /*!< PWMA_SWCOUT: SM0OUT23 Mask              */
#define PWMA_SWCOUT_SM0OUT23_SHIFT               1                                                   /*!< PWMA_SWCOUT: SM0OUT23 Position          */
#define PWMA_SWCOUT_SM0OUT23(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SWCOUT_SM0OUT23_SHIFT))&PWMA_SWCOUT_SM0OUT23_MASK) /*!< PWMA_SWCOUT                             */
#define PWMA_SWCOUT_SM1OUT45_MASK                (0x01UL << PWMA_SWCOUT_SM1OUT45_SHIFT)              /*!< PWMA_SWCOUT: SM1OUT45 Mask              */
#define PWMA_SWCOUT_SM1OUT45_SHIFT               2                                                   /*!< PWMA_SWCOUT: SM1OUT45 Position          */
#define PWMA_SWCOUT_SM1OUT45(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SWCOUT_SM1OUT45_SHIFT))&PWMA_SWCOUT_SM1OUT45_MASK) /*!< PWMA_SWCOUT                             */
#define PWMA_SWCOUT_SM1OUT23_MASK                (0x01UL << PWMA_SWCOUT_SM1OUT23_SHIFT)              /*!< PWMA_SWCOUT: SM1OUT23 Mask              */
#define PWMA_SWCOUT_SM1OUT23_SHIFT               3                                                   /*!< PWMA_SWCOUT: SM1OUT23 Position          */
#define PWMA_SWCOUT_SM1OUT23(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SWCOUT_SM1OUT23_SHIFT))&PWMA_SWCOUT_SM1OUT23_MASK) /*!< PWMA_SWCOUT                             */
#define PWMA_SWCOUT_SM2OUT45_MASK                (0x01UL << PWMA_SWCOUT_SM2OUT45_SHIFT)              /*!< PWMA_SWCOUT: SM2OUT45 Mask              */
#define PWMA_SWCOUT_SM2OUT45_SHIFT               4                                                   /*!< PWMA_SWCOUT: SM2OUT45 Position          */
#define PWMA_SWCOUT_SM2OUT45(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SWCOUT_SM2OUT45_SHIFT))&PWMA_SWCOUT_SM2OUT45_MASK) /*!< PWMA_SWCOUT                             */
#define PWMA_SWCOUT_SM2OUT23_MASK                (0x01UL << PWMA_SWCOUT_SM2OUT23_SHIFT)              /*!< PWMA_SWCOUT: SM2OUT23 Mask              */
#define PWMA_SWCOUT_SM2OUT23_SHIFT               5                                                   /*!< PWMA_SWCOUT: SM2OUT23 Position          */
#define PWMA_SWCOUT_SM2OUT23(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SWCOUT_SM2OUT23_SHIFT))&PWMA_SWCOUT_SM2OUT23_MASK) /*!< PWMA_SWCOUT                             */
#define PWMA_SWCOUT_SM3OUT45_MASK                (0x01UL << PWMA_SWCOUT_SM3OUT45_SHIFT)              /*!< PWMA_SWCOUT: SM3OUT45 Mask              */
#define PWMA_SWCOUT_SM3OUT45_SHIFT               6                                                   /*!< PWMA_SWCOUT: SM3OUT45 Position          */
#define PWMA_SWCOUT_SM3OUT45(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SWCOUT_SM3OUT45_SHIFT))&PWMA_SWCOUT_SM3OUT45_MASK) /*!< PWMA_SWCOUT                             */
#define PWMA_SWCOUT_SM3OUT23_MASK                (0x01UL << PWMA_SWCOUT_SM3OUT23_SHIFT)              /*!< PWMA_SWCOUT: SM3OUT23 Mask              */
#define PWMA_SWCOUT_SM3OUT23_SHIFT               7                                                   /*!< PWMA_SWCOUT: SM3OUT23 Position          */
#define PWMA_SWCOUT_SM3OUT23(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_SWCOUT_SM3OUT23_SHIFT))&PWMA_SWCOUT_SM3OUT23_MASK) /*!< PWMA_SWCOUT                             */
