podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F15.h
#define SIM_SCGC6_PIT(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_PIT_SHIFT))&SIM_SCGC6_PIT_MASK) /*!< SIM_SCGC6                               */
#define SIM_SCGC6_FTM0_MASK                      (0x01UL << SIM_SCGC6_FTM0_SHIFT)                    /*!< SIM_SCGC6: FTM0 Mask                    */
#define SIM_SCGC6_FTM0_SHIFT                     24                                                  /*!< SIM_SCGC6: FTM0 Position                */
#define SIM_SCGC6_FTM0(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_FTM0_SHIFT))&SIM_SCGC6_FTM0_MASK) /*!< SIM_SCGC6                               */
#define SIM_SCGC6_FTM1_MASK                      (0x01UL << SIM_SCGC6_FTM1_SHIFT)                    /*!< SIM_SCGC6: FTM1 Mask                    */
#define SIM_SCGC6_FTM1_SHIFT                     25                                                  /*!< SIM_SCGC6: FTM1 Position                */
#define SIM_SCGC6_FTM1(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_FTM1_SHIFT))&SIM_SCGC6_FTM1_MASK) /*!< SIM_SCGC6                               */
#define SIM_SCGC6_DAC0_MASK                      (0x01UL << SIM_SCGC6_DAC0_SHIFT)                    /*!< SIM_SCGC6: DAC0 Mask                    */
#define SIM_SCGC6_DAC0_SHIFT                     31                                                  /*!< SIM_SCGC6: DAC0 Position                */
#define SIM_SCGC6_DAC0(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_SCGC6_DAC0_SHIFT))&SIM_SCGC6_DAC0_MASK) /*!< SIM_SCGC6                               */
/* ------- SCGC7 Bit Fields                         ------ */
#define SIM_SCGC7_DMA_MASK                       (0x01UL << SIM_SCGC7_DMA_SHIFT)                     /*!< SIM_SCGC7: DMA Mask                     */
#define SIM_SCGC7_DMA_SHIFT                      8                                                   /*!< SIM_SCGC7: DMA Position                 */
#define SIM_SCGC7_DMA(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_SCGC7_DMA_SHIFT))&SIM_SCGC7_DMA_MASK) /*!< SIM_SCGC7                               */
/* ------- CLKDIV1 Bit Fields                       ------ */
#define SIM_CLKDIV1_OUTDIV4_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV4_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV4 Mask               */
#define SIM_CLKDIV1_OUTDIV4_SHIFT                16                                                  /*!< SIM_CLKDIV1: OUTDIV4 Position           */
#define SIM_CLKDIV1_OUTDIV4(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV4_SHIFT))&SIM_CLKDIV1_OUTDIV4_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV2_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV2_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV2 Mask               */
#define SIM_CLKDIV1_OUTDIV2_SHIFT                24                                                  /*!< SIM_CLKDIV1: OUTDIV2 Position           */
#define SIM_CLKDIV1_OUTDIV2(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV2_SHIFT))&SIM_CLKDIV1_OUTDIV2_MASK) /*!< SIM_CLKDIV1                             */
#define SIM_CLKDIV1_OUTDIV1_MASK                 (0x0FUL << SIM_CLKDIV1_OUTDIV1_SHIFT)               /*!< SIM_CLKDIV1: OUTDIV1 Mask               */
#define SIM_CLKDIV1_OUTDIV1_SHIFT                28                                                  /*!< SIM_CLKDIV1: OUTDIV1 Position           */
#define SIM_CLKDIV1_OUTDIV1(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV1_OUTDIV1_SHIFT))&SIM_CLKDIV1_OUTDIV1_MASK) /*!< SIM_CLKDIV1                             */
/* ------- FCFG1 Bit Fields                         ------ */
#define SIM_FCFG1_FLASHDIS_MASK                  (0x01UL << SIM_FCFG1_FLASHDIS_SHIFT)                /*!< SIM_FCFG1: FLASHDIS Mask                */
#define SIM_FCFG1_FLASHDIS_SHIFT                 0                                                   /*!< SIM_FCFG1: FLASHDIS Position            */
#define SIM_FCFG1_FLASHDIS(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_FLASHDIS_SHIFT))&SIM_FCFG1_FLASHDIS_MASK) /*!< SIM_FCFG1                               */
#define SIM_FCFG1_FLASHDOZE_MASK                 (0x01UL << SIM_FCFG1_FLASHDOZE_SHIFT)               /*!< SIM_FCFG1: FLASHDOZE Mask               */
#define SIM_FCFG1_FLASHDOZE_SHIFT                1                                                   /*!< SIM_FCFG1: FLASHDOZE Position           */
#define SIM_FCFG1_FLASHDOZE(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_FLASHDOZE_SHIFT))&SIM_FCFG1_FLASHDOZE_MASK) /*!< SIM_FCFG1                               */
#define SIM_FCFG1_PFSIZE_MASK                    (0x0FUL << SIM_FCFG1_PFSIZE_SHIFT)                  /*!< SIM_FCFG1: PFSIZE Mask                  */
#define SIM_FCFG1_PFSIZE_SHIFT                   24                                                  /*!< SIM_FCFG1: PFSIZE Position              */
#define SIM_FCFG1_PFSIZE(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_FCFG1_PFSIZE_SHIFT))&SIM_FCFG1_PFSIZE_MASK) /*!< SIM_FCFG1                               */
/* ------- FCFG2 Bit Fields                         ------ */
#define SIM_FCFG2_MAXADDR0_MASK                  (0x7FUL << SIM_FCFG2_MAXADDR0_SHIFT)                /*!< SIM_FCFG2: MAXADDR0 Mask                */
#define SIM_FCFG2_MAXADDR0_SHIFT                 24                                                  /*!< SIM_FCFG2: MAXADDR0 Position            */
#define SIM_FCFG2_MAXADDR0(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_FCFG2_MAXADDR0_SHIFT))&SIM_FCFG2_MAXADDR0_MASK) /*!< SIM_FCFG2                               */
/* ------- UIDH Bit Fields                          ------ */
#define SIM_UIDH_UID_MASK                        (0xFFFFFFFFUL << SIM_UIDH_UID_SHIFT)                /*!< SIM_UIDH: UID Mask                      */
#define SIM_UIDH_UID_SHIFT                       0                                                   /*!< SIM_UIDH: UID Position                  */
#define SIM_UIDH_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDH_UID_SHIFT))&SIM_UIDH_UID_MASK) /*!< SIM_UIDH                                */
/* ------- UIDMH Bit Fields                         ------ */
#define SIM_UIDMH_UID_MASK                       (0xFFFFFFFFUL << SIM_UIDMH_UID_SHIFT)               /*!< SIM_UIDMH: UID Mask                     */
#define SIM_UIDMH_UID_SHIFT                      0                                                   /*!< SIM_UIDMH: UID Position                 */
#define SIM_UIDMH_UID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_UIDMH_UID_SHIFT))&SIM_UIDMH_UID_MASK) /*!< SIM_UIDMH                               */
/* ------- UIDML Bit Fields                         ------ */
#define SIM_UIDML_UID_MASK                       (0xFFFFFFFFUL << SIM_UIDML_UID_SHIFT)               /*!< SIM_UIDML: UID Mask                     */
#define SIM_UIDML_UID_SHIFT                      0                                                   /*!< SIM_UIDML: UID Position                 */
#define SIM_UIDML_UID(x)                         (((uint32_t)(((uint32_t)(x))<<SIM_UIDML_UID_SHIFT))&SIM_UIDML_UID_MASK) /*!< SIM_UIDML                               */
/* ------- UIDL Bit Fields                          ------ */
#define SIM_UIDL_UID_MASK                        (0xFFFFFFFFUL << SIM_UIDL_UID_SHIFT)                /*!< SIM_UIDL: UID Mask                      */
#define SIM_UIDL_UID_SHIFT                       0                                                   /*!< SIM_UIDL: UID Position                  */
#define SIM_UIDL_UID(x)                          (((uint32_t)(((uint32_t)(x))<<SIM_UIDL_UID_SHIFT))&SIM_UIDL_UID_MASK) /*!< SIM_UIDL                                */
/* ------- CLKDIV4 Bit Fields                       ------ */
#define SIM_CLKDIV4_TRACEFRAC_MASK               (0x01UL << SIM_CLKDIV4_TRACEFRAC_SHIFT)             /*!< SIM_CLKDIV4: TRACEFRAC Mask             */
#define SIM_CLKDIV4_TRACEFRAC_SHIFT              0                                                   /*!< SIM_CLKDIV4: TRACEFRAC Position         */
#define SIM_CLKDIV4_TRACEFRAC(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV4_TRACEFRAC_SHIFT))&SIM_CLKDIV4_TRACEFRAC_MASK) /*!< SIM_CLKDIV4                             */
#define SIM_CLKDIV4_TRACEDIV_MASK                (0x07UL << SIM_CLKDIV4_TRACEDIV_SHIFT)              /*!< SIM_CLKDIV4: TRACEDIV Mask              */
#define SIM_CLKDIV4_TRACEDIV_SHIFT               1                                                   /*!< SIM_CLKDIV4: TRACEDIV Position          */
#define SIM_CLKDIV4_TRACEDIV(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV4_TRACEDIV_SHIFT))&SIM_CLKDIV4_TRACEDIV_MASK) /*!< SIM_CLKDIV4                             */
#define SIM_CLKDIV4_TRACEDIVEN_MASK              (0x01UL << SIM_CLKDIV4_TRACEDIVEN_SHIFT)            /*!< SIM_CLKDIV4: TRACEDIVEN Mask            */
#define SIM_CLKDIV4_TRACEDIVEN_SHIFT             28                                                  /*!< SIM_CLKDIV4: TRACEDIVEN Position        */
#define SIM_CLKDIV4_TRACEDIVEN(x)                (((uint32_t)(((uint32_t)(x))<<SIM_CLKDIV4_TRACEDIVEN_SHIFT))&SIM_CLKDIV4_TRACEDIVEN_MASK) /*!< SIM_CLKDIV4                             */
/* ------- MISCTRL Bit Fields                       ------ */
#define SIM_MISCTRL_CMPWIN0SRC_MASK              (0x03UL << SIM_MISCTRL_CMPWIN0SRC_SHIFT)            /*!< SIM_MISCTRL: CMPWIN0SRC Mask            */
#define SIM_MISCTRL_CMPWIN0SRC_SHIFT             8                                                   /*!< SIM_MISCTRL: CMPWIN0SRC Position        */
#define SIM_MISCTRL_CMPWIN0SRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_CMPWIN0SRC_SHIFT))&SIM_MISCTRL_CMPWIN0SRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_CMPWIN1SRC_MASK              (0x03UL << SIM_MISCTRL_CMPWIN1SRC_SHIFT)            /*!< SIM_MISCTRL: CMPWIN1SRC Mask            */
#define SIM_MISCTRL_CMPWIN1SRC_SHIFT             10                                                  /*!< SIM_MISCTRL: CMPWIN1SRC Position        */
#define SIM_MISCTRL_CMPWIN1SRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_CMPWIN1SRC_SHIFT))&SIM_MISCTRL_CMPWIN1SRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_CMPWIN2SRC_MASK              (0x03UL << SIM_MISCTRL_CMPWIN2SRC_SHIFT)            /*!< SIM_MISCTRL: CMPWIN2SRC Mask            */
#define SIM_MISCTRL_CMPWIN2SRC_SHIFT             12                                                  /*!< SIM_MISCTRL: CMPWIN2SRC Position        */
#define SIM_MISCTRL_CMPWIN2SRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_CMPWIN2SRC_SHIFT))&SIM_MISCTRL_CMPWIN2SRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_CMPWIN3SRC_MASK              (0x03UL << SIM_MISCTRL_CMPWIN3SRC_SHIFT)            /*!< SIM_MISCTRL: CMPWIN3SRC Mask            */
#define SIM_MISCTRL_CMPWIN3SRC_SHIFT             14                                                  /*!< SIM_MISCTRL: CMPWIN3SRC Position        */
#define SIM_MISCTRL_CMPWIN3SRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_CMPWIN3SRC_SHIFT))&SIM_MISCTRL_CMPWIN3SRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_EWMINSRC_MASK                (0x01UL << SIM_MISCTRL_EWMINSRC_SHIFT)              /*!< SIM_MISCTRL: EWMINSRC Mask              */
#define SIM_MISCTRL_EWMINSRC_SHIFT               16                                                  /*!< SIM_MISCTRL: EWMINSRC Position          */
#define SIM_MISCTRL_EWMINSRC(x)                  (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_EWMINSRC_SHIFT))&SIM_MISCTRL_EWMINSRC_MASK) /*!< SIM_MISCTRL                             */
#define SIM_MISCTRL_DACTRIGSRC_MASK              (0x03UL << SIM_MISCTRL_DACTRIGSRC_SHIFT)            /*!< SIM_MISCTRL: DACTRIGSRC Mask            */
#define SIM_MISCTRL_DACTRIGSRC_SHIFT             18                                                  /*!< SIM_MISCTRL: DACTRIGSRC Position        */
#define SIM_MISCTRL_DACTRIGSRC(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL_DACTRIGSRC_SHIFT))&SIM_MISCTRL_DACTRIGSRC_MASK) /*!< SIM_MISCTRL                             */
/* ------- MISCTRL2 Bit Fields                      ------ */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG0_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG0 Mask    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT     8                                                   /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG0 Position*/
#define SIM_MISCTRL2_SYNCXBARAPITTRIG0(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT))&SIM_MISCTRL2_SYNCXBARAPITTRIG0_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG1_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG1 Mask    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT     9                                                   /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG1 Position*/
#define SIM_MISCTRL2_SYNCXBARAPITTRIG1(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT))&SIM_MISCTRL2_SYNCXBARAPITTRIG1_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG2_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG2 Mask    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT     10                                                  /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG2 Position*/
#define SIM_MISCTRL2_SYNCXBARAPITTRIG2(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT))&SIM_MISCTRL2_SYNCXBARAPITTRIG2_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG3_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG3 Mask    */
#define SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT     11                                                  /*!< SIM_MISCTRL2: SYNCXBARAPITTRIG3 Position*/
#define SIM_MISCTRL2_SYNCXBARAPITTRIG3(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT))&SIM_MISCTRL2_SYNCXBARAPITTRIG3_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG0_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARBPITTRIG0 Mask    */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT     12                                                  /*!< SIM_MISCTRL2: SYNCXBARBPITTRIG0 Position*/
#define SIM_MISCTRL2_SYNCXBARBPITTRIG0(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT))&SIM_MISCTRL2_SYNCXBARBPITTRIG0_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG1_MASK      (0x01UL << SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT)    /*!< SIM_MISCTRL2: SYNCXBARBPITTRIG1 Mask    */
#define SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT     13                                                  /*!< SIM_MISCTRL2: SYNCXBARBPITTRIG1 Position*/
#define SIM_MISCTRL2_SYNCXBARBPITTRIG1(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT))&SIM_MISCTRL2_SYNCXBARBPITTRIG1_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCDACHWTRIG_MASK          (0x01UL << SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT)        /*!< SIM_MISCTRL2: SYNCDACHWTRIG Mask        */
#define SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT         16                                                  /*!< SIM_MISCTRL2: SYNCDACHWTRIG Position    */
#define SIM_MISCTRL2_SYNCDACHWTRIG(x)            (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT))&SIM_MISCTRL2_SYNCDACHWTRIG_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCEWMIN_MASK              (0x01UL << SIM_MISCTRL2_SYNCEWMIN_SHIFT)            /*!< SIM_MISCTRL2: SYNCEWMIN Mask            */
#define SIM_MISCTRL2_SYNCEWMIN_SHIFT             17                                                  /*!< SIM_MISCTRL2: SYNCEWMIN Position        */
#define SIM_MISCTRL2_SYNCEWMIN(x)                (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCEWMIN_SHIFT))&SIM_MISCTRL2_SYNCEWMIN_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_MASK      (0x01UL << SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT)    /*!< SIM_MISCTRL2: SYNCCMP0SAMPLEWIN Mask    */
#define SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT     20                                                  /*!< SIM_MISCTRL2: SYNCCMP0SAMPLEWIN Position*/
#define SIM_MISCTRL2_SYNCCMP0SAMPLEWIN(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT))&SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_MASK      (0x01UL << SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT)    /*!< SIM_MISCTRL2: SYNCCMP1SAMPLEWIN Mask    */
#define SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT     21                                                  /*!< SIM_MISCTRL2: SYNCCMP1SAMPLEWIN Position*/
#define SIM_MISCTRL2_SYNCCMP1SAMPLEWIN(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT))&SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_MASK      (0x01UL << SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT)    /*!< SIM_MISCTRL2: SYNCCMP2SAMPLEWIN Mask    */
#define SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT     22                                                  /*!< SIM_MISCTRL2: SYNCCMP2SAMPLEWIN Position*/
#define SIM_MISCTRL2_SYNCCMP2SAMPLEWIN(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT))&SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_MASK) /*!< SIM_MISCTRL2                            */
#define SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_MASK      (0x01UL << SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT)    /*!< SIM_MISCTRL2: SYNCCMP3SAMPLEWIN Mask    */
#define SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT     23                                                  /*!< SIM_MISCTRL2: SYNCCMP3SAMPLEWIN Position*/
#define SIM_MISCTRL2_SYNCCMP3SAMPLEWIN(x)        (((uint32_t)(((uint32_t)(x))<<SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT))&SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_MASK) /*!< SIM_MISCTRL2                            */
/* ------- WDOGC Bit Fields                         ------ */
#define SIM_WDOGC_WDOGCLKS_MASK                  (0x01UL << SIM_WDOGC_WDOGCLKS_SHIFT)                /*!< SIM_WDOGC: WDOGCLKS Mask                */
#define SIM_WDOGC_WDOGCLKS_SHIFT                 1                                                   /*!< SIM_WDOGC: WDOGCLKS Position            */
#define SIM_WDOGC_WDOGCLKS(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_WDOGC_WDOGCLKS_SHIFT))&SIM_WDOGC_WDOGCLKS_MASK) /*!< SIM_WDOGC                               */
/* ------- PWRC Bit Fields                          ------ */
#define SIM_PWRC_SRPDN_MASK                      (0x03UL << SIM_PWRC_SRPDN_SHIFT)                    /*!< SIM_PWRC: SRPDN Mask                    */
#define SIM_PWRC_SRPDN_SHIFT                     0                                                   /*!< SIM_PWRC: SRPDN Position                */
#define SIM_PWRC_SRPDN(x)                        (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SRPDN_SHIFT))&SIM_PWRC_SRPDN_MASK) /*!< SIM_PWRC                                */
#define SIM_PWRC_SR27STDBY_MASK                  (0x03UL << SIM_PWRC_SR27STDBY_SHIFT)                /*!< SIM_PWRC: SR27STDBY Mask                */
#define SIM_PWRC_SR27STDBY_SHIFT                 2                                                   /*!< SIM_PWRC: SR27STDBY Position            */
#define SIM_PWRC_SR27STDBY(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SR27STDBY_SHIFT))&SIM_PWRC_SR27STDBY_MASK) /*!< SIM_PWRC                                */
#define SIM_PWRC_SR12STDBY_MASK                  (0x03UL << SIM_PWRC_SR12STDBY_SHIFT)                /*!< SIM_PWRC: SR12STDBY Mask                */
#define SIM_PWRC_SR12STDBY_SHIFT                 6                                                   /*!< SIM_PWRC: SR12STDBY Position            */
#define SIM_PWRC_SR12STDBY(x)                    (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SR12STDBY_SHIFT))&SIM_PWRC_SR12STDBY_MASK) /*!< SIM_PWRC                                */
#define SIM_PWRC_SRPWRDETEN_MASK                 (0x01UL << SIM_PWRC_SRPWRDETEN_SHIFT)               /*!< SIM_PWRC: SRPWRDETEN Mask               */
#define SIM_PWRC_SRPWRDETEN_SHIFT                8                                                   /*!< SIM_PWRC: SRPWRDETEN Position           */
#define SIM_PWRC_SRPWRDETEN(x)                   (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SRPWRDETEN_SHIFT))&SIM_PWRC_SRPWRDETEN_MASK) /*!< SIM_PWRC                                */
#define SIM_PWRC_SRPWRRDY_MASK                   (0x01UL << SIM_PWRC_SRPWRRDY_SHIFT)                 /*!< SIM_PWRC: SRPWRRDY Mask                 */
#define SIM_PWRC_SRPWRRDY_SHIFT                  9                                                   /*!< SIM_PWRC: SRPWRRDY Position             */
#define SIM_PWRC_SRPWRRDY(x)                     (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SRPWRRDY_SHIFT))&SIM_PWRC_SRPWRRDY_MASK) /*!< SIM_PWRC                                */
#define SIM_PWRC_SRPWROK_MASK                    (0x01UL << SIM_PWRC_SRPWROK_SHIFT)                  /*!< SIM_PWRC: SRPWROK Mask                  */
#define SIM_PWRC_SRPWROK_SHIFT                   16                                                  /*!< SIM_PWRC: SRPWROK Position              */
#define SIM_PWRC_SRPWROK(x)                      (((uint32_t)(((uint32_t)(x))<<SIM_PWRC_SRPWROK_SHIFT))&SIM_PWRC_SRPWROK_MASK) /*!< SIM_PWRC                                */
/* ------- ADCOPT Bit Fields                        ------ */
#define SIM_ADCOPT_ADCACH6SEL_MASK               (0x07UL << SIM_ADCOPT_ADCACH6SEL_SHIFT)             /*!< SIM_ADCOPT: ADCACH6SEL Mask             */
#define SIM_ADCOPT_ADCACH6SEL_SHIFT              0                                                   /*!< SIM_ADCOPT: ADCACH6SEL Position         */
#define SIM_ADCOPT_ADCACH6SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_ADCOPT_ADCACH6SEL_SHIFT))&SIM_ADCOPT_ADCACH6SEL_MASK) /*!< SIM_ADCOPT                              */
#define SIM_ADCOPT_ADCACH7SEL_MASK               (0x07UL << SIM_ADCOPT_ADCACH7SEL_SHIFT)             /*!< SIM_ADCOPT: ADCACH7SEL Mask             */
#define SIM_ADCOPT_ADCACH7SEL_SHIFT              4                                                   /*!< SIM_ADCOPT: ADCACH7SEL Position         */
#define SIM_ADCOPT_ADCACH7SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_ADCOPT_ADCACH7SEL_SHIFT))&SIM_ADCOPT_ADCACH7SEL_MASK) /*!< SIM_ADCOPT                              */
#define SIM_ADCOPT_ADCBCH6SEL_MASK               (0x07UL << SIM_ADCOPT_ADCBCH6SEL_SHIFT)             /*!< SIM_ADCOPT: ADCBCH6SEL Mask             */
#define SIM_ADCOPT_ADCBCH6SEL_SHIFT              8                                                   /*!< SIM_ADCOPT: ADCBCH6SEL Position         */
#define SIM_ADCOPT_ADCBCH6SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_ADCOPT_ADCBCH6SEL_SHIFT))&SIM_ADCOPT_ADCBCH6SEL_MASK) /*!< SIM_ADCOPT                              */
#define SIM_ADCOPT_ADCBCH7SEL_MASK               (0x07UL << SIM_ADCOPT_ADCBCH7SEL_SHIFT)             /*!< SIM_ADCOPT: ADCBCH7SEL Mask             */
#define SIM_ADCOPT_ADCBCH7SEL_SHIFT              12                                                  /*!< SIM_ADCOPT: ADCBCH7SEL Position         */
#define SIM_ADCOPT_ADCBCH7SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIM_ADCOPT_ADCBCH7SEL_SHIFT))&SIM_ADCOPT_ADCBCH7SEL_MASK) /*!< SIM_ADCOPT                              */
#define SIM_ADCOPT_ROSB_MASK                     (0x01UL << SIM_ADCOPT_ROSB_SHIFT)                   /*!< SIM_ADCOPT: ROSB Mask                   */
