podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKV43F15.h
/* XBARA - Peripheral instance base addresses */
#define XBARA_BasePtr                  0x40059000UL //!< Peripheral base address
#define XBARA                          ((XBARA_Type *) XBARA_BasePtr) //!< Freescale base pointer
#define XBARA_BASE_PTR                 (XBARA) //!< Freescale style base pointer
/**
 * @} */ /* End group XBARA_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup XBARB_Peripheral_access_layer_GROUP XBARB Peripheral Access Layer
* @brief C Struct for XBARB
* @{
*/

/* ================================================================================ */
/* ================           XBARB (file:XBARB_MKV40)             ================ */
/* ================================================================================ */

/**
 * @brief Crossbar Switch
 */
/**
* @addtogroup XBARB_structs_GROUP XBARB struct
* @brief Struct for XBARB
* @{
*/
typedef struct {                                /*       XBARB Structure                                              */
   __IO uint16_t  SEL0;                         /**< 0000: Crossbar B Select Register 0                                 */
   __IO uint16_t  SEL1;                         /**< 0002: Crossbar B Select Register 1                                 */
   __IO uint16_t  SEL2;                         /**< 0004: Crossbar B Select Register 2                                 */
   __IO uint16_t  SEL3;                         /**< 0006: Crossbar B Select Register 3                                 */
   __IO uint16_t  SEL4;                         /**< 0008: Crossbar B Select Register 4                                 */
   __IO uint16_t  SEL5;                         /**< 000A: Crossbar B Select Register 5                                 */
   __IO uint16_t  SEL6;                         /**< 000C: Crossbar B Select Register 6                                 */
   __IO uint16_t  SEL7;                         /**< 000E: Crossbar B Select Register 7                                 */
} XBARB_Type;

/**
 * @} */ /* End group XBARB_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'XBARB' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup XBARB_Register_Masks_GROUP XBARB Register Masks
* @brief Register Masks for XBARB
* @{
*/
/* ------- SEL0 Bit Fields                          ------ */
#define XBARB_SEL0_SEL0_MASK                     (0x1FUL << XBARB_SEL0_SEL0_SHIFT)                   /*!< XBARB_SEL0: SEL0 Mask                   */
#define XBARB_SEL0_SEL0_SHIFT                    0                                                   /*!< XBARB_SEL0: SEL0 Position               */
#define XBARB_SEL0_SEL0(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL0_SEL0_SHIFT))&XBARB_SEL0_SEL0_MASK) /*!< XBARB_SEL0                              */
#define XBARB_SEL0_SEL1_MASK                     (0x1FUL << XBARB_SEL0_SEL1_SHIFT)                   /*!< XBARB_SEL0: SEL1 Mask                   */
#define XBARB_SEL0_SEL1_SHIFT                    8                                                   /*!< XBARB_SEL0: SEL1 Position               */
#define XBARB_SEL0_SEL1(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL0_SEL1_SHIFT))&XBARB_SEL0_SEL1_MASK) /*!< XBARB_SEL0                              */
/* ------- SEL1 Bit Fields                          ------ */
#define XBARB_SEL1_SEL2_MASK                     (0x1FUL << XBARB_SEL1_SEL2_SHIFT)                   /*!< XBARB_SEL1: SEL2 Mask                   */
#define XBARB_SEL1_SEL2_SHIFT                    0                                                   /*!< XBARB_SEL1: SEL2 Position               */
#define XBARB_SEL1_SEL2(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL1_SEL2_SHIFT))&XBARB_SEL1_SEL2_MASK) /*!< XBARB_SEL1                              */
#define XBARB_SEL1_SEL3_MASK                     (0x1FUL << XBARB_SEL1_SEL3_SHIFT)                   /*!< XBARB_SEL1: SEL3 Mask                   */
#define XBARB_SEL1_SEL3_SHIFT                    8                                                   /*!< XBARB_SEL1: SEL3 Position               */
#define XBARB_SEL1_SEL3(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL1_SEL3_SHIFT))&XBARB_SEL1_SEL3_MASK) /*!< XBARB_SEL1                              */
/* ------- SEL2 Bit Fields                          ------ */
#define XBARB_SEL2_SEL4_MASK                     (0x1FUL << XBARB_SEL2_SEL4_SHIFT)                   /*!< XBARB_SEL2: SEL4 Mask                   */
#define XBARB_SEL2_SEL4_SHIFT                    0                                                   /*!< XBARB_SEL2: SEL4 Position               */
#define XBARB_SEL2_SEL4(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL2_SEL4_SHIFT))&XBARB_SEL2_SEL4_MASK) /*!< XBARB_SEL2                              */
#define XBARB_SEL2_SEL5_MASK                     (0x1FUL << XBARB_SEL2_SEL5_SHIFT)                   /*!< XBARB_SEL2: SEL5 Mask                   */
#define XBARB_SEL2_SEL5_SHIFT                    8                                                   /*!< XBARB_SEL2: SEL5 Position               */
#define XBARB_SEL2_SEL5(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL2_SEL5_SHIFT))&XBARB_SEL2_SEL5_MASK) /*!< XBARB_SEL2                              */
/* ------- SEL3 Bit Fields                          ------ */
#define XBARB_SEL3_SEL6_MASK                     (0x1FUL << XBARB_SEL3_SEL6_SHIFT)                   /*!< XBARB_SEL3: SEL6 Mask                   */
#define XBARB_SEL3_SEL6_SHIFT                    0                                                   /*!< XBARB_SEL3: SEL6 Position               */
#define XBARB_SEL3_SEL6(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL3_SEL6_SHIFT))&XBARB_SEL3_SEL6_MASK) /*!< XBARB_SEL3                              */
#define XBARB_SEL3_SEL7_MASK                     (0x1FUL << XBARB_SEL3_SEL7_SHIFT)                   /*!< XBARB_SEL3: SEL7 Mask                   */
#define XBARB_SEL3_SEL7_SHIFT                    8                                                   /*!< XBARB_SEL3: SEL7 Position               */
#define XBARB_SEL3_SEL7(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL3_SEL7_SHIFT))&XBARB_SEL3_SEL7_MASK) /*!< XBARB_SEL3                              */
/* ------- SEL4 Bit Fields                          ------ */
#define XBARB_SEL4_SEL8_MASK                     (0x1FUL << XBARB_SEL4_SEL8_SHIFT)                   /*!< XBARB_SEL4: SEL8 Mask                   */
#define XBARB_SEL4_SEL8_SHIFT                    0                                                   /*!< XBARB_SEL4: SEL8 Position               */
#define XBARB_SEL4_SEL8(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL4_SEL8_SHIFT))&XBARB_SEL4_SEL8_MASK) /*!< XBARB_SEL4                              */
#define XBARB_SEL4_SEL9_MASK                     (0x1FUL << XBARB_SEL4_SEL9_SHIFT)                   /*!< XBARB_SEL4: SEL9 Mask                   */
#define XBARB_SEL4_SEL9_SHIFT                    8                                                   /*!< XBARB_SEL4: SEL9 Position               */
#define XBARB_SEL4_SEL9(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL4_SEL9_SHIFT))&XBARB_SEL4_SEL9_MASK) /*!< XBARB_SEL4                              */
/* ------- SEL5 Bit Fields                          ------ */
#define XBARB_SEL5_SEL10_MASK                    (0x1FUL << XBARB_SEL5_SEL10_SHIFT)                  /*!< XBARB_SEL5: SEL10 Mask                  */
#define XBARB_SEL5_SEL10_SHIFT                   0                                                   /*!< XBARB_SEL5: SEL10 Position              */
#define XBARB_SEL5_SEL10(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL5_SEL10_SHIFT))&XBARB_SEL5_SEL10_MASK) /*!< XBARB_SEL5                              */
#define XBARB_SEL5_SEL11_MASK                    (0x1FUL << XBARB_SEL5_SEL11_SHIFT)                  /*!< XBARB_SEL5: SEL11 Mask                  */
#define XBARB_SEL5_SEL11_SHIFT                   8                                                   /*!< XBARB_SEL5: SEL11 Position              */
#define XBARB_SEL5_SEL11(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL5_SEL11_SHIFT))&XBARB_SEL5_SEL11_MASK) /*!< XBARB_SEL5                              */
/* ------- SEL6 Bit Fields                          ------ */
#define XBARB_SEL6_SEL12_MASK                    (0x1FUL << XBARB_SEL6_SEL12_SHIFT)                  /*!< XBARB_SEL6: SEL12 Mask                  */
#define XBARB_SEL6_SEL12_SHIFT                   0                                                   /*!< XBARB_SEL6: SEL12 Position              */
#define XBARB_SEL6_SEL12(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL6_SEL12_SHIFT))&XBARB_SEL6_SEL12_MASK) /*!< XBARB_SEL6                              */
#define XBARB_SEL6_SEL13_MASK                    (0x1FUL << XBARB_SEL6_SEL13_SHIFT)                  /*!< XBARB_SEL6: SEL13 Mask                  */
#define XBARB_SEL6_SEL13_SHIFT                   8                                                   /*!< XBARB_SEL6: SEL13 Position              */
#define XBARB_SEL6_SEL13(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL6_SEL13_SHIFT))&XBARB_SEL6_SEL13_MASK) /*!< XBARB_SEL6                              */
/* ------- SEL7 Bit Fields                          ------ */
#define XBARB_SEL7_SEL14_MASK                    (0x1FUL << XBARB_SEL7_SEL14_SHIFT)                  /*!< XBARB_SEL7: SEL14 Mask                  */
#define XBARB_SEL7_SEL14_SHIFT                   0                                                   /*!< XBARB_SEL7: SEL14 Position              */
#define XBARB_SEL7_SEL14(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL7_SEL14_SHIFT))&XBARB_SEL7_SEL14_MASK) /*!< XBARB_SEL7                              */
#define XBARB_SEL7_SEL15_MASK                    (0x1FUL << XBARB_SEL7_SEL15_SHIFT)                  /*!< XBARB_SEL7: SEL15 Mask                  */
#define XBARB_SEL7_SEL15_SHIFT                   8                                                   /*!< XBARB_SEL7: SEL15 Position              */
#define XBARB_SEL7_SEL15(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL7_SEL15_SHIFT))&XBARB_SEL7_SEL15_MASK) /*!< XBARB_SEL7                              */
/**
 * @} */ /* End group XBARB_Register_Masks_GROUP 
 */

/* XBARB - Peripheral instance base addresses */
#define XBARB_BasePtr                  0x4005A000UL //!< Peripheral base address
#define XBARB                          ((XBARB_Type *) XBARB_BasePtr) //!< Freescale base pointer
#define XBARB_BASE_PTR                 (XBARB) //!< Freescale style base pointer
/**
 * @} */ /* End group XBARB_Peripheral_access_layer_GROUP 
 */
/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif
/**
 * @} */ /* End group Peripheral_access_layer_GROUP 
 */

#ifdef __cplusplus
}
#endif


#endif  /* MCU_MKV43F15 */

